<!DOCTYPE html>
<html  lang="zh">
<head>
    <meta charset="utf-8">
<title>Etiqueta: 论文笔记 - Ivan的记录</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />



    <meta name="description" content="这是我学习过程的记录">
<meta name="keywords" content="博客，Java，Geek">
<meta property="og:type" content="website">
<meta property="og:title" content="Ivan的记录">
<meta property="og:url" content="https://ivanlu1024.github.io/tags/论文笔记/index.html">
<meta property="og:site_name" content="Ivan的记录">
<meta property="og:description" content="这是我学习过程的记录">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://ivanlu1024.github.io/images/og_image.png">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Ivan的记录">
<meta name="twitter:description" content="这是我学习过程的记录">
<meta name="twitter:image" content="https://ivanlu1024.github.io/images/og_image.png">







<link rel="icon" href="/images/favicon.svg">


<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bulma@0.7.2/css/bulma.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.4.1/css/all.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Ubuntu:400,600|Source+Code+Pro">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/highlight.js@9.12.0/styles/atom-one-light.css">


    
    
    
    <style>body>.footer,body>.navbar,body>.section{opacity:0}</style>
    

    
    
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/css/lightgallery.min.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/css/justifiedGallery.min.css">
    

    
    

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/outdatedbrowser@1.1.5/outdatedbrowser/outdatedbrowser.min.css">


    
    
    
    

<link rel="stylesheet" href="/css/back-to-top.css">


    
    

    
    
    
    

    
    
<link rel="stylesheet" href="/css/progressbar.css">
<script src="https://cdn.jsdelivr.net/npm/pace-js@1.0.2/pace.min.js"></script>

    
    
    

    
    
    


<link rel="stylesheet" href="/css/style.css">
</head>
<body class="is-3-column">
    <nav class="navbar navbar-main">
    <div class="container">
        <div class="navbar-brand is-flex-center">
            <a class="navbar-item navbar-logo" href="/">
            
                <img src="/images/logo.svg" alt="Ivan的记录" height="28">
            
            </a>
        </div>
        <div class="navbar-menu">
            
            <div class="navbar-start">
                
                <a class="navbar-item"
                href="/">Home</a>
                
                <a class="navbar-item"
                href="/archives">Archives</a>
                
                <a class="navbar-item"
                href="/categories">Categories</a>
                
                <a class="navbar-item"
                href="/tags">Tags</a>
                
                <a class="navbar-item"
                href="/about">About</a>
                
            </div>
            
            <div class="navbar-end">
                
                    
                    
                    <a class="navbar-item" target="_blank" title="Download on GitHub" href="https://github.com/ppoffice/hexo-theme-icarus">
                        
                        <i class="fab fa-github"></i>
                        
                    </a>
                    
                
                
                
                <a class="navbar-item search" title="Search" href="javascript:;">
                    <i class="fas fa-search"></i>
                </a>
                
            </div>
        </div>
    </div>
</nav>
    
    <section class="section">
        <div class="container">
            <div class="columns">
                <div class="column is-8-tablet is-8-desktop is-6-widescreen has-order-2 column-main"><div class="card">
    <div class="card-content">
        <nav class="breadcrumb" aria-label="breadcrumbs">
        <ul>
            <li><a href="/tags">Etiquetas</a></li>
            <li class="is-active"><a href="#" aria-current="page">论文笔记</a></li>
        </ul>
        </nav>
    </div>
</div>

    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    15 minutes read (About 2237 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/03/19/论文笔记04：A Heterogeneity-Aware Task Scheduler for Spark/">论文笔记04：A Heterogeneity-Aware Task Scheduler for Spark</a>
            
        </h1>
        <div class="content">
            <h1 id="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;04&#xFF1A;A-Heterogeneity-Aware-Task-Scheduler-for-Spark"><a href="#&#x8BBA;&#x6587;&#x7B14;&#x8BB0;04&#xFF1A;A-Heterogeneity-Aware-Task-Scheduler-for-Spark" class="headerlink" title="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;04&#xFF1A;A Heterogeneity-Aware Task Scheduler for Spark"></a>&#x8BBA;&#x6587;&#x7B14;&#x8BB0;04&#xFF1A;A Heterogeneity-Aware Task Scheduler for Spark</h1><p>&#x53D1;&#x8868;&#x4E8E;2018</p>
<h2 id="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"><a href="#&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"></a>&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</h2><p>&#x5927;&#x6570;&#x636E;&#x5E73;&#x53F0;&#x7684;&#x5E94;&#x7528;&#x6CA1;&#x6709;&#x5173;&#x6CE8;&#x5230;&#x591A;&#x7EF4;&#x5EA6;&#x7684;&#x5F02;&#x6784;&#x573A;&#x666F;&#xFF0C;&#x5BFC;&#x81F4;&#x5728;&#x8C03;&#x5EA6;&#x8D44;&#x6E90;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E94;&#x7528;&#x548C;&#x786C;&#x4EF6;&#x7279;&#x6027;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x4E0D;&#x5339;&#x914D;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"></a>&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</h2><h3 id="2-1-&#x521B;&#x65B0;&#x70B9;"><a href="#2-1-&#x521B;&#x65B0;&#x70B9;" class="headerlink" title="2.1 &#x521B;&#x65B0;&#x70B9;"></a>2.1 &#x521B;&#x65B0;&#x70B9;</h3><p>&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x5F02;&#x6784;&#x611F;&#x77E5;&#x7684;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x7CFB;&#x7EDF;&#x2014;&#x2014;RUPAM&#xFF0C;&#x540C;&#x65F6;&#x8003;&#x8651;&#x4EFB;&#x52A1;&#x7EA7;&#x522B;&#x7684;&#x8D44;&#x6E90;&#x7279;&#x5F81;&#x548C;&#x786C;&#x4EF6;&#x5C42;&#x9762;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x3002;RUPAM&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x4F46;&#x9AD8;&#x6548;&#x7684;&#x542F;&#x53D1;&#x5F0F;&#x53BB;&#x51B3;&#x5B9A;&#x4E3B;&#x5BFC;&#x578B;&#x7684;&#x8C03;&#x5EA6;&#x56E0;&#x7D20;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x653E;&#x7F6E;&#x5230;&#x7279;&#x5B9A;&#x7684;stage&#x4E0A;&#x3002;</p>
<h3 id="2-2-&#x7ED3;&#x679C;"><a href="#2-2-&#x7ED3;&#x679C;" class="headerlink" title="2.2 &#x7ED3;&#x679C;"></a>2.2 &#x7ED3;&#x679C;</h3><p>RUPAM&#x5BF9;&#x4E8E;Spark&#x6807;&#x51C6;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x6765;&#x8BF4;&#x63D0;&#x5347;&#x4E86;62.3%&#x7684;&#x6027;&#x80FD;</p>
<h2 id="&#x4E09;&#x3001;&#x80CC;&#x666F;"><a href="#&#x4E09;&#x3001;&#x80CC;&#x666F;" class="headerlink" title="&#x4E09;&#x3001;&#x80CC;&#x666F;"></a>&#x4E09;&#x3001;&#x80CC;&#x666F;</h2><h3 id="Spark&#x8C03;&#x5EA6;"><a href="#Spark&#x8C03;&#x5EA6;" class="headerlink" title="Spark&#x8C03;&#x5EA6;"></a>Spark&#x8C03;&#x5EA6;</h3><p>&#x5F53;&#x524D;&#x7684;Spark&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x8C03;&#x5EA6;&#xFF1A;</p>
<ul>
<li><strong>&#x5E94;&#x7528;&#x7EA7;&#x522B;&#x8C03;&#x5EA6;&#xFF1A;</strong>&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x5185;&#x7F6E;&#x7684;standalone&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x5668;&#x548C;&#x5916;&#x90E8;&#x7684;Mesos&#x3001;YARN&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x7BA1;&#x7406;&#x5668;&#x901A;&#x5E38;&#x4F1A;&#x62BD;&#x8C61;&#x786C;&#x4EF6;&#x5C5E;&#x6027;&#x4E3A;CPU&#x6838;&#x6570;&#x548C;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x5C40;&#x9650;&#x6027;&#x4F53;&#x73B0;&#x5728;<strong>&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#x4E0D;&#x80FD;&#x591F;&#x52A8;&#x6001;&#x5730;&#x6EE1;&#x8DB3;&#x5E94;&#x7528;&#x7684;&#x9700;&#x6C42;</strong>&#x3002;</li>
<li><strong>&#x4EFB;&#x52A1;&#x7EA7;&#x522B;&#x8C03;&#x5EA6;&#xFF1A;</strong>&#x5F53;&#x524D;&#x7684;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x5668;&#x53EA;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x7ED9;&#x4E00;&#x4E2A;CPU&#x7684;&#x6838;&#x4E0A;&#xFF0C;&#x53EA;&#x8003;&#x8651;&#x4E86;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x73B0;&#x6709;&#x7684;&#x5F02;&#x6784;&#x6027;&#x611F;&#x77E5;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x4EC5;&#x5173;&#x6CE8;&#x5E95;&#x5C42;&#x8282;&#x70B9;&#x7684;&#x5F02;&#x6784;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;<strong>&#x5047;&#x8BBE;&#x540C;&#x4E00;Map / Reduce&#x9636;&#x6BB5;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;</strong>&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x793A;&#xFF0C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6210;&#x7ACB;&#x3002;</li>
</ul>
<h3 id="&#x524D;&#x7F6E;&#x7814;&#x7A76;"><a href="#&#x524D;&#x7F6E;&#x7814;&#x7A76;" class="headerlink" title="&#x524D;&#x7F6E;&#x7814;&#x7A76;"></a>&#x524D;&#x7F6E;&#x7814;&#x7A76;</h3><p>&#x4E3A;&#x4E86;&#x8BC4;&#x4F30;&#x5F53;&#x524D;Spark&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x4E86;&#x4E00;&#x4E9B;&#x5B9E;&#x9A8C;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;</p>
<ul>
<li><strong>&#x5728;&#x5355;&#x4E2A;&#x5E94;&#x7528;&#x4E0A;&#x7684;&#x4E0D;&#x540C;stage&#x7684;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x662F;&#x4E0D;&#x540C;&#x7684;</strong>&#xFF1A;&#x5F53;&#x524D;Spark&#x8C03;&#x5EA6;&#x5668;&#x53EA;&#x662F;&#x9759;&#x6001;&#x5730;&#x5C06;CPU&#x6838;&#x548C;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5206;&#x914D;&#x7ED9;&#x7ED9;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x5982;&#x5F53;&#x524D;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#x800C;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x6240;&#x9700;&#x8D44;&#x6E90;&#x4E2D;&#x7684;&#x8FD9;&#x79CD;&#x591A;&#x6837;&#x6027;&#x548C;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x3002;</li>
<li><strong>&#x5355;&#x4E2A;stage&#x5B58;&#x5728;&#x4EFB;&#x52A1;&#x504F;&#x5DEE;</strong>&#xFF1A;&#x5F53;&#x524D;&#x5F02;&#x6784;&#x611F;&#x77E5;&#x8C03;&#x5EA6;&#x5668;&#x5047;&#x8BBE;&#x540C;&#x4E00;&#x4E2A;stage&#x4E0A;&#x4EFB;&#x52A1;&#x6709;&#x7740;&#x76F8;&#x4F3C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8868;&#x73B0;&#x6027;&#x80FD;&#x4E5F;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x8868;&#x660E;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#xFF0C;Spark&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#xFF0C; &#x5176;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x4E5F;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x8BBE;&#x8BA1;"><a href="#&#x56DB;&#x3001;&#x8BBE;&#x8BA1;" class="headerlink" title="&#x56DB;&#x3001;&#x8BBE;&#x8BA1;"></a>&#x56DB;&#x3001;&#x8BBE;&#x8BA1;</h2><h3 id="A-&#x7CFB;&#x7EDF;&#x67B6;&#x6784;"><a href="#A-&#x7CFB;&#x7EDF;&#x67B6;&#x6784;" class="headerlink" title="A. &#x7CFB;&#x7EDF;&#x67B6;&#x6784;"></a>A. &#x7CFB;&#x7EDF;&#x67B6;&#x6784;</h3><p>RUPAM&#x662F;&#x4E00;&#x79CD;&#x4EFB;&#x52A1;&#x7EA7;&#x522B;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x4E0E;&#x5E94;&#x7528;&#x7EA7;&#x522B;&#x548C;&#x4F5C;&#x4E1A;&#x7EA7;&#x522B;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;</p>
<div align="center"><br>    <img src="picts/04A01.png"><br></div>

<ul>
<li><strong>Resource Monitor(RM)&#xFF1A;</strong>&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x5668;&#xFF0C;&#x8D1F;&#x8D23;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x3002;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x5728;Spark&#x7684;Master&#x548C;Worker&#x7684;&#x76D1;&#x89C6;&#x5668;&#xFF0C;&#x6536;&#x96C6;&#x5668;&#x62A5;&#x544A;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x8D44;&#x6E90;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x4F8B;&#x5982;CPU&#x3001;&#x5185;&#x5B58;&#x3001;&#x7F51;&#x7EDC;&#x3001;I/O&#x548C;GPU&#x7B49;&#x3002;&#x76D1;&#x89C6;&#x5668;&#x8D1F;&#x8D23;&#x4ECE;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x4E0A;&#x6536;&#x96C6;&#x548C;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x8FD8;&#x80FD;&#x591F;&#x62D3;&#x5C55;&#x6536;&#x96C6;&#x8D44;&#x6E90;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</li>
<li><strong>Task Manager (TM)&#xFF1A;</strong>&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x8DDF;&#x8E2A;&#x4EFB;&#x52A1;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4EE5;&#x786E;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x4EFB;&#x4F55;<strong>&#x8D44;&#x6E90;&#x74F6;&#x9888;</strong>&#x3002;</li>
<li><strong>Dispatcher&#xFF1A;</strong>&#x5B9E;&#x73B0;RUPAM&#x7684;&#x4E3B;&#x8981;&#x903B;&#x8F91;&#xFF0C;&#x4F8B;&#x5982;&#x51B3;&#x5B9A;&#x542F;&#x52A8;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;executor&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x5339;&#x914D;&#x5408;&#x9002;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x8282;&#x70B9;&#x542F;&#x52A8;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x57FA;&#x4E8E;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<p>&#x5229;&#x7528;TM&#x548C;Dispatcher&#x6765;&#x53D6;&#x4EE3;Spark&#x5185;&#x7F6E;&#x7684;TaskScheduler&#xFF0C;&#x4E0D;&#x5355;&#x5355;&#x8003;&#x8651;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#xFF0C;&#x800C;&#x662F;&#x540C;&#x65F6;&#x8003;&#x8651;&#x4EFB;&#x52A1;&#x548C;&#x8282;&#x70B9;&#x7684;&#x8D44;&#x6E90;&#x7279;&#x6027;&#x6765;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="B-&#x5B9E;&#x65F6;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x548C;&#x4EFB;&#x52A1;&#x76D1;&#x63A7;"><a href="#B-&#x5B9E;&#x65F6;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x548C;&#x4EFB;&#x52A1;&#x76D1;&#x63A7;" class="headerlink" title="B. &#x5B9E;&#x65F6;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x548C;&#x4EFB;&#x52A1;&#x76D1;&#x63A7;"></a>B. &#x5B9E;&#x65F6;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x548C;&#x4EFB;&#x52A1;&#x76D1;&#x63A7;</h3><p>&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x74F6;&#x9888;&#x671F;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x4EFB;&#x52A1;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E0A;&#x8DDF;&#x8E2A;&#x8282;&#x70B9;&#x7684;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4E3A;&#x4E86;&#x4F4E;&#x5EF6;&#x8FDF;&#x6765;&#x51B3;&#x5B9A;&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x5230;&#x6700;&#x4F18;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x6267;&#x884C;&#x3002;</p>
<ol>
<li><p>&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#xFF1A;</p>
<p>RUPAM&#x5229;&#x7528;&#x5FC3;&#x8DF3;&#x673A;&#x5236;&#x5468;&#x671F;&#x6027;&#x5730;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x7EF4;&#x5EA6;&#x7684;&#x786C;&#x4EF6;&#x4FE1;&#x606F;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x8D44;&#x6E90;&#x7684;&#x4F18;&#x5148;&#x961F;&#x5217;&#x3002;RUPAM&#x53EA;&#x9700;&#x8981;&#x5C06;&#x8282;&#x70B9;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E0B;&#x4E00;&#x8F6E;&#x8C03;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#x6E05;&#x7A7A;&#x961F;&#x5217;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x8F83;&#x5C0F;&#x7684;&#x961F;&#x5217;&#x6765;&#x964D;&#x4F4E;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
</li>
<li><p>&#x4EFB;&#x52A1;&#x76D1;&#x63A7;&#xFF1A;</p>
<p>&#x4E3A;&#x4E86;&#x7ED9;&#x5B9A;&#x7684;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;RUPAM&#x4E5F;&#x9700;&#x8981;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x7684;&#x7279;&#x6027;&#x6765;&#x8FDB;&#x884C;&#x51B3;&#x7B56;&#x3002;RUPAM&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x6765;&#x5B58;&#x50A8;&#x5468;&#x671F;&#x6027;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x4EFB;&#x52A1;&#x7279;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x5C06;&#x5206;&#x8FA8;&#x5728;&#x540C;&#x4E00;&#x4E2A;stage&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x7684;&#x4E0D;&#x540C;&#xFF0C;TM&#x4E3A;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8D44;&#x6E90;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x9891;&#x7E41;&#x7684;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#xFF0C;RUPAM&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5E2E;&#x52A9;&#x7EBF;&#x7A0B;&#x6765;&#x8F85;&#x52A9;&#x3002;</p>
</li>
</ol>
<h3 id="C-&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;"><a href="#C-&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;" class="headerlink" title="C. &#x4EFB;&#x52A1;&#x8C03;&#x5EA6;"></a>C. &#x4EFB;&#x52A1;&#x8C03;&#x5EA6;</h3><p>&#x4F18;&#x5316;&#x76EE;&#x6807;&#x662F;&#xFF1A;&#x6700;&#x5C0F;&#x5316;&#x5BF9;&#x6240;&#x6709;&#x673A;&#x5668;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x7684;&#x603B;&#x6267;&#x884C;&#x65F6;&#x95F4;</p>
<p>&#x5F53;&#x524D;&#x6700;&#x6D41;&#x884C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x5217;&#x8868;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4EFB;&#x52A1;&#x6620;&#x5C04;&#x5230;&#x53EF;&#x7528;&#x7684;&#x673A;&#x5668;&#x800C;&#x4E0D;&#x4F1A;&#x5F15;&#x5165;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x3002;&#x7531;&#x4E8E;&#x5217;&#x8868;&#x8C03;&#x5EA6;&#x63D0;&#x4F9B;&#x4E86;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x7406;&#x8BBA;&#x754C;&#x9650;&#x7684;&#x5B9E;&#x9645;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;RUPAM&#x91C7;&#x53D6;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x8D2A;&#x5FC3;&#x7684;&#x542F;&#x53D1;&#x5F0F;&#x7B97;&#x6CD5;&#x3002;&#x8003;&#x8651;&#x7684;&#x56E0;&#x7D20;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x786C;&#x4EF6;&#x8282;&#x70B9;&#x7684;&#x5BB9;&#x91CF;&#xFF08;SSD,GPU&#xFF09;</li>
<li>&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x8D44;&#x6E90;&#x6D88;&#x8017;</li>
<li>&#x8282;&#x70B9;&#x4E2D;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x8D44;&#x6E90;&#x4E89;&#x7528;</li>
<li>&#x8FD0;&#x884C;&#x5728;&#x540C;&#x4E00;&#x8282;&#x70B9;&#x7684;&#x4EFB;&#x52A1;&#x6570;&#x91CF;</li>
<li>&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;</li>
</ul>
<h4 id="1-&#x8C03;&#x5EA6;&#x7B56;&#x7565;"><a href="#1-&#x8C03;&#x5EA6;&#x7B56;&#x7565;" class="headerlink" title="1. &#x8C03;&#x5EA6;&#x7B56;&#x7565;"></a>1. &#x8C03;&#x5EA6;&#x7B56;&#x7565;</h4><p>Dispatcher&#x5728;task&#x961F;&#x5217;&#x548C;&#x8D44;&#x6E90;&#x961F;&#x5217;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x5339;&#x914D;&#x4EFB;&#x52A1;&#xFF0C;&#x5728;RM&#x586B;&#x5145;&#x8D44;&#x6E90;&#x961F;&#x5217;&#x4E4B;&#x540E;&#xFF0C;RUPAM&#x4EE5;&#x8F6E;&#x8BE2;&#x7684;&#x65B9;&#x5F0F;&#x4E00;&#x6B21;&#x4ECE;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5355;&#x4E00;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#x7684;&#x4EFB;&#x52A1;&#x9965;&#x997F;&#x3002;&#x8FD9;&#x79CD;&#x542F;&#x53D1;&#x5F0F;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x6709;<strong>&#x6700;&#x4F73;&#x5BB9;&#x91CF;&#x548C;&#x6700;&#x4F4E;&#x4E89;&#x7528;&#x8D44;&#x6E90;R&#x7684;&#x8282;&#x70B9;N</strong>&#xFF0C;&#x7136;&#x540E;&#x5C06;N&#x8C03;&#x5EA6;&#x5230;&#x4EFB;&#x52A1;T&#xFF0C;&#x5176;&#x4E2D;R&#x4F5C;&#x4E3A;&#x5176;&#x5148;&#x524D;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x5982;&#x4ECA;N&#x4E3A;T&#x63D0;&#x4F9B;&#x4E86;&#x6700;&#x4F73;&#x4F4D;&#x7F6E;&#x3002;RUPAM&#x6CA1;&#x6709;&#x5C1D;&#x8BD5;&#x5BF9;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x7684;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x8C03;&#x5EA6;&#x5EF6;&#x8FDF;&#xFF0C;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x3002;&#x5C06;&#x4EFB;&#x52A1;&#x201C;&#x9501;&#x5B9A;&#x201D;&#x5230;&#x63D0;&#x4F9B;&#x6700;&#x4F73;&#x89C2;&#x5BDF;&#x6027;&#x80FD;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x7531;&#x4E8E;&#x4EFB;&#x52A1;&#x7279;&#x5F81;&#x7684;<strong>&#x4E34;&#x65F6;&#x6CE2;&#x52A8;</strong>&#x800C;&#x5728;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="2-&#x8D44;&#x6E90;&#x5206;&#x914D;"><a href="#2-&#x8D44;&#x6E90;&#x5206;&#x914D;" class="headerlink" title="2. &#x8D44;&#x6E90;&#x5206;&#x914D;"></a>2. &#x8D44;&#x6E90;&#x5206;&#x914D;</h4><p>Spark&#x5728;&#x542F;&#x52A8;executor&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x4E3A;&#x5176;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;CPU&#x6838;&#x6570;&#x548C;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x79CD;&#x9759;&#x6001;&#x7684;&#x914D;&#x7F6E;&#x5176;&#x5B9E;&#x662F;&#x4F4E;&#x6548;&#x7684;&#x3002;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x5728;&#x5F02;&#x6784;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x8282;&#x70B9;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x548C;CPU&#x6838;&#x6570;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#xFF0C;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;CPU&#x6838;&#x6570;&#x6765;&#x51B3;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;slot&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#xFF1B;</li>
<li>&#x901A;&#x8FC7;&#x8D85;&#x63D0;&#x4EA4;&#x4E00;&#x4E9B;&#x5177;&#x6709;&#x7A7A;&#x95F2;&#x8D44;&#x6E90;&#x7684;&#x8282;&#x70B9;&#x548C;&#x7528;&#x9002;&#x5F53;&#x7684;&#x4EFB;&#x52A1;&#x5339;&#x914D;&#x8282;&#x70B9;&#xFF0C;RUPAM&#x53EF;&#x4EE5;&#x91CD;&#x53E0;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x7684;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<h4 id="3-&#x843D;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#xFF08;Straggler&#xFF09;&#x548C;&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x5B9A;&#x4F4D;"><a href="#3-&#x843D;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#xFF08;Straggler&#xFF09;&#x548C;&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x5B9A;&#x4F4D;" class="headerlink" title="3. &#x843D;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#xFF08;Straggler&#xFF09;&#x548C;&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x5B9A;&#x4F4D;"></a>3. &#x843D;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#xFF08;Straggler&#xFF09;&#x548C;&#x4EFB;&#x52A1;&#x7684;&#x91CD;&#x5B9A;&#x4F4D;</h4><p>&#x4E3A;&#x4E86;&#x5F25;&#x8865;Dispatcher&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x6B21;&#x4F18;&#x51B3;&#x7B56;&#xFF0C;RUPAM&#x8FD8;&#x4E0E;&#x6700;&#x8FD1;&#x5F15;&#x5165;&#x7684;Spark&#x63A8;&#x6D4B;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x5728;&#x53EF;&#x7528;&#x8282;&#x70B9;&#x4E2D;&#x542F;&#x52A8;Straggler&#x7684;&#x526F;&#x672C;&#x3002;&#x5F53;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x9608;&#x503C;&#xFF08;&#x9ED8;&#x8BA4;&#x662F;&#x603B;&#x6570;&#x7684;75%&#xFF09;&#xFF0C;&#x8BE5;&#x63A8;&#x6D4B;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x641C;&#x7D22;&#x90A3;&#x4E9B;&#x8017;&#x65F6;&#x8D85;&#x8FC7;&#x5DF2;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x5E73;&#x5747;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x4E00;&#x4E2A;&#x7CFB;&#x6570;&#x7684;&#x4EFB;&#x52A1;&#x5E76;&#x4E14;&#x5C06;&#x5176;&#x6807;&#x8BB0;&#x4E3A;Straggler&#x4EFB;&#x52A1;&#x3002;Straggler&#x7684;&#x526F;&#x672C;&#x5C06;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x9664;&#x4E86;&#x88AB;Spark&#x68C0;&#x6D4B;&#x4E3A;&#x6807;&#x51C6;Straggler&#x4E4B;&#x5916;&#xFF0C;RUPAM&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x6839;&#x636E;&#x5F02;&#x6784;&#x73AF;&#x5883;&#x68C0;&#x6D4B;Straggler&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;JVM&#x4E2D;&#x7684;OOM&#x5F02;&#x5E38;&#xFF0C;RUPAM&#x8FD8;&#x91C7;&#x53D6;&#x4E86;&#x4E00;&#x79CD;&#x6FC0;&#x8FDB;&#x5730;&#x7B56;&#x7565;&#x68C0;&#x6D4B;&#x5185;&#x5B58;&#x7684;straggler&#x3002;&#x9996;&#x5148;&#xFF0C;&#x53EA;&#x8981;RM&#x68C0;&#x6D4B;&#x5230;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x8F83;&#x4F4E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C31;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7ED9;TM&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;TM&#x6807;&#x8BB0;&#x90A3;&#x4E9B;&#x5360;&#x7528;&#x8F83;&#x591A;&#x5185;&#x5B58;&#x7684;&#x4EFB;&#x52A1;&#x4E3A;Straggler&#xFF0C;&#x5E76;&#x7EC8;&#x6B62;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x6807;&#x8BB0;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x7684;&#x526F;&#x672C;&#x53D1;&#x9001;&#x5230;TM&#xFF0C;TM&#x4F1A;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x7684;&#x7279;&#x6027;&#x6765;&#x786E;&#x5B9A;&#x5176;&#x74F6;&#x9888;&#x5E76;&#x4E14;&#x5C06;&#x5176;&#x518D;&#x6B21;&#x653E;&#x5165;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x3002;Dispatcher&#x53C8;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x5C06;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x5230;&#x9002;&#x5408;&#x7684;&#x95F2;&#x7F6E;&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x76EE;&#x6807;&#x548C;&#x8BBE;&#x5B9A;"><a href="#&#x4E94;&#x3001;&#x76EE;&#x6807;&#x548C;&#x8BBE;&#x5B9A;" class="headerlink" title="&#x4E94;&#x3001;&#x76EE;&#x6807;&#x548C;&#x8BBE;&#x5B9A;"></a>&#x4E94;&#x3001;&#x76EE;&#x6807;&#x548C;&#x8BBE;&#x5B9A;</h2><h3 id="&#x8BBE;&#x5B9A;"><a href="#&#x8BBE;&#x5B9A;" class="headerlink" title="&#x8BBE;&#x5B9A;"></a>&#x8BBE;&#x5B9A;</h3><p>&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x95F4;&#x6839;&#x636E;&#x673A;&#x5668;&#x53D8;&#x5316;</p>
<h3 id="&#x4F18;&#x5316;&#x76EE;&#x6807;"><a href="#&#x4F18;&#x5316;&#x76EE;&#x6807;" class="headerlink" title="&#x4F18;&#x5316;&#x76EE;&#x6807;"></a>&#x4F18;&#x5316;&#x76EE;&#x6807;</h3><p>&#x6700;&#x5C0F;&#x5316;&#x6700;&#x5927;&#x5B8C;&#x5DE5;&#x65F6;&#x95F4;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    3 minutes read (About 440 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/">论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds</a>
            
        </h1>
        <div class="content">
            <h1 id="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;05&#xFF1A;SABA-A-security-aware-and-budget-aware-workflow-scheduling-strategy-in-clouds"><a href="#&#x8BBA;&#x6587;&#x7B14;&#x8BB0;05&#xFF1A;SABA-A-security-aware-and-budget-aware-workflow-scheduling-strategy-in-clouds" class="headerlink" title="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;05&#xFF1A;SABA A security-aware and budget-aware workflow scheduling strategy in clouds"></a>&#x8BBA;&#x6587;&#x7B14;&#x8BB0;05&#xFF1A;SABA A security-aware and budget-aware workflow scheduling strategy in clouds</h1><p>&#x53D1;&#x8868;&#x4E8E;2014.7</p>
<h2 id="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"><a href="#&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"></a>&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</h2><p>&#x5BF9;&#x4E8E;&#x4E91;&#x73AF;&#x5883;&#x4E0B;&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x5E94;&#x7528;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x4E2D;&#xFF0C;&#x89E3;&#x51B3;&#x5F53;&#x524D;&#x7814;&#x7A76;&#x4E2D;&#x5FFD;&#x89C6;&#x7684;&#x5E26;&#x6709;&#x5B89;&#x5168;&#x8981;&#x6C42;&#x548C;&#x4F8B;&#x5982;&#x50CF;&#x5185;&#x5B58;&#xFF0C;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x5BB9;&#x91CF;&#x8FD9;&#x4E9B;&#x5176;&#x4ED6;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"></a>&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</h2><h3 id="2-1-&#x521B;&#x65B0;&#x70B9;"><a href="#2-1-&#x521B;&#x65B0;&#x70B9;" class="headerlink" title="2.1 &#x521B;&#x65B0;&#x70B9;"></a>2.1 &#x521B;&#x65B0;&#x70B9;</h3><p>&#x7531;&#x4E8E;&#x8003;&#x8651;&#x4E86;&#x5B89;&#x5168;&#x548C;&#x82B1;&#x8D39;&#x63D0;&#x51FA;&#x4E86;<strong>&#x201C;&#x4E0D;&#x53EF;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x96C6;&#x201D;</strong>&#x7684;&#x6982;&#x5FF5;&#x7528;&#x6765;&#x7EA6;&#x675F;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x7684;&#x79FB;&#x52A8;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x63D0;&#x51FA;&#x5728;&#x4E86;&#x4E00;&#x79CD;&#x5B89;&#x5168;&#x611F;&#x77E5;&#x548C;&#x9884;&#x7B97;&#x611F;&#x77E5;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x66F4;&#x52A0;&#x7AEF;&#x7684;&#x5B8C;&#x5DE5;&#x65F6;&#x95F4;&#x548C;&#x540C;&#x6837;&#x5B89;&#x5168;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="2-2-&#x4E3B;&#x8981;&#x8D21;&#x732E;"><a href="#2-2-&#x4E3B;&#x8981;&#x8D21;&#x732E;" class="headerlink" title="2.2 &#x4E3B;&#x8981;&#x8D21;&#x732E;"></a>2.2 &#x4E3B;&#x8981;&#x8D21;&#x732E;</h3><ul>
<li>&#x63D0;&#x51FA;&#x4E86;SABA&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x7ED9;&#x5B9A;&#x9884;&#x7B97;&#x4E0B;&#x5728;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x63D0;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x66F4;&#x77ED;&#x7684;&#x5B8C;&#x5DE5;&#x65F6;&#x95F4;&#xFF1B;</li>
<li>&#x5728;&#x5B89;&#x5168;&#x7EA6;&#x675F;&#x4E0B;&#x62D3;&#x5C55;&#x4E86;&#x591A;&#x7EF4;&#x5EA6;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x3001;&#x5185;&#x5B58;&#x3001;&#x5B58;&#x50A8;&#x7B49;&#xFF1B;</li>
<li>&#x63D0;&#x51FA;&#x4E86;&#x201C;&#x4E0D;&#x53EF;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x96C6;&#x201D;&#x7684;&#x6982;&#x5FF5;</li>
</ul>
<h2 id="&#x4E09;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;"><a href="#&#x4E09;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;" class="headerlink" title="&#x4E09;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;"></a>&#x4E09;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;</h2><p>&#x73B0;&#x6709;&#x7814;&#x7A76;&#x4E0D;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x5E26;&#x6709;&#x5B89;&#x5168;&#x7EA6;&#x675F;&#x7684;&#x5728;&#x4E91;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x5E94;&#x7528;&#x7684;&#x4E09;&#x70B9;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x63D0;&#x4EA4;&#x4EFB;&#x52A1;&#x53CA;&#x5176;&#x6240;&#x9700;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x7684;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x6210;&#x672C;&#x7684;&#x5F71;&#x54CD;&#x6BD4;&#x8F83;&#x5927;&#xFF1B;</li>
<li>&#x73B0;&#x6709;&#x7814;&#x7A76;&#x8003;&#x8651;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x662F;&#x53EF;&#x79FB;&#x52A8;&#x7684;&#xFF1B;</li>
<li>&#x73B0;&#x6709;&#x4E91;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x90FD;&#x662F;&#x5171;&#x4EAB;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x4E0E;&#x672A;&#x77E5;&#x79DF;&#x6237;&#x5171;&#x4EAB;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x53EF;&#x80FD;&#x662F;&#x67D0;&#x4E9B;&#x5DE5;&#x4F5C;&#x6D41;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x9AD8;&#x5EA6;&#x4FDD;&#x8BC1;&#x4E0E;&#x903B;&#x8F91;&#x5206;&#x79BB;&#x7684;&#x5B89;&#x5168;&#x673A;&#x5236;&#x7684;&#x5F3A;&#x5EA6;&#x3002;</li>
</ol>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    8 minutes read (About 1206 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/03/19/论文笔记06：Security and privacy aspects in MapReduce on clouds A survey/">论文笔记06：Security and privacy aspects in MapReduce on clouds A survey</a>
            
        </h1>
        <div class="content">
            <h1 id="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;06&#xFF1A;Security-and-privacy-aspects-in-MapReduce-on-clouds-A-survey"><a href="#&#x8BBA;&#x6587;&#x7B14;&#x8BB0;06&#xFF1A;Security-and-privacy-aspects-in-MapReduce-on-clouds-A-survey" class="headerlink" title="&#x8BBA;&#x6587;&#x7B14;&#x8BB0;06&#xFF1A;Security and privacy aspects in MapReduce on clouds A survey"></a>&#x8BBA;&#x6587;&#x7B14;&#x8BB0;06&#xFF1A;Security and privacy aspects in MapReduce on clouds A survey</h1><h2 id="&#x4E00;&#x3001;&#x4ECB;&#x7ECD;"><a href="#&#x4E00;&#x3001;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x4E00;&#x3001;&#x4ECB;&#x7ECD;"></a>&#x4E00;&#x3001;&#x4ECB;&#x7ECD;</h2><p>&#x4E91;&#x8BA1;&#x7B97;&#x63D0;&#x4F9B;&#x4E09;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x670D;&#x52A1;&#xFF1A;</p>
<ol>
<li>IaaS&#xFF1B;</li>
<li>PaaS&#xFF1B;</li>
<li>SaaS</li>
</ol>
<p>&#x4E91;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#xFF1A;</p>
<ol>
<li>&#x516C;&#x6709;&#x4E91;&#xFF1B;</li>
<li>&#x79C1;&#x6709;&#x4E91;&#xFF1B;</li>
<li>&#x6DF7;&#x5408;&#x4E91;</li>
</ol>
<p>MapReduce&#x5728;&#x6700;&#x521D;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;MapReduce&#x6846;&#x67B6;&#x8981;&#x89E3;&#x51B3;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x653B;&#x51FB;&#xFF1A;</p>
<ul>
<li>&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF1B;</li>
<li>&#x4FDD;&#x5BC6;&#x6027;&#xFF08;&#x7A83;&#x542C;&#x548C;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF09;</li>
<li>&#x6570;&#x636E;&#x7BE1;&#x6539;</li>
<li>&#x786C;&#x4EF6;&#x7BE1;&#x6539;</li>
<li>&#x8F6F;&#x4EF6;&#x7BE1;&#x6539;</li>
</ul>
<p>&#x5B89;&#x5168;&#x6027;&#x548C;&#x9690;&#x79C1;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x53E6;&#x5916;&#x533A;&#x522B;&#x5728;&#x4E8E;<strong>&#x5B89;&#x5168;&#x6027;&#x66F4;&#x591A;&#x662F;&#x4E8C;&#x5143;&#x95EE;&#x9898;</strong>&#xFF0C;&#x5373;&#x653B;&#x51FB;&#x6210;&#x529F;&#x4E0E;&#x5426;&#xFF0C;&#x800C;&#x5728;&#x9690;&#x79C1;&#x8BBE;&#x7F6E;&#x4E2D;&#x662F;&#x5173;&#x6CE8;&#x4E8E;<strong>&#x6570;&#x636E;&#x9690;&#x79C1;&#x4E0E;&#x6846;&#x67B6;&#x5229;&#x7528;</strong>&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x6743;&#x8861;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x6311;&#x6218;"><a href="#&#x4E8C;&#x3001;&#x6311;&#x6218;" class="headerlink" title="&#x4E8C;&#x3001;&#x6311;&#x6218;"></a>&#x4E8C;&#x3001;&#x6311;&#x6218;</h2><p>&#x5BF9;&#x4E8E;&#x5E26;&#x6709;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x65B9;&#x9762;&#x7684;MapReduce&#x5B58;&#x5728;&#x7740;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#xFF1A;</p>
<ul>
<li>&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x5B58;&#x50A8;&#x5E26;&#x6765;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x9690;&#x60A3;&#xFF1B;</li>
<li>MapReduce&#x8BA1;&#x7B97;&#x7684;&#x9AD8;&#x5EA6;&#x5206;&#x5E03;&#x5F0F;&#x7279;&#x6027;&#xFF1A;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x7ED9;&#x6570;&#x636E;&#x5B89;&#x5168;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x9690;&#x60A3;&#xFF0C;&#x5728;MapReduce&#x4E2D;&#x8BC6;&#x522B;&#x5E26;&#x6709;&#x653B;&#x51FB;&#x6027;&#x7684;mapper&#x6216;&#x8005;reducer&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x6570;&#x636E;&#x6D41;&#xFF1A;&#x6839;&#x636E;&#x6570;&#x636E;&#x7684;&#x654F;&#x611F;&#x6027;&#x6765;&#x4E0D;&#x540C;&#x5730;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x4F1A;&#x5728;&#x5B58;&#x50A8;&#x8282;&#x70B9;&#x548C;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF1B;MapReduce&#x7684;&#x4E0D;&#x540C;&#x8BA1;&#x7B97;&#x9636;&#x6BB5;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x4E0A;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF1B;</li>
<li>&#x516C;&#x6709;&#x4E91;&#x7684;&#x9ED1;&#x76D2;&#x7279;&#x6027;&#x652F;&#x6301;&#x7740;MapReduce</li>
<li>&#x6DF7;&#x5408;&#x4E91;&#xFF1A;MapReduce&#x662F;&#x8BBE;&#x8BA1;&#x5728;&#x5355;&#x4E00;&#x4E91;&#x73AF;&#x5883;&#x4E0B;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x654F;&#x611F;&#x6027;&#x6570;&#x636E;&#x548C;&#x975E;&#x654F;&#x611F;&#x6027;&#x6570;&#x636E;&#x7684;&#x5206;&#x914D;&#x589E;&#x52A0;&#x4E86;MapReduce&#x4F7F;&#x7528;&#x7684;&#x6311;&#x6218;&#xFF1B;</li>
<li>&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5BB9;&#x9519;&#x673A;&#x5236;&#x548C;&#x900F;&#x660E;&#x6027;&#xFF1A;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x65B9;&#x9762;&#x7684;&#x673A;&#x5236;&#x4E0D;&#x5E94;&#x8BE5;&#x5F71;&#x54CD;MapReduce&#x7684;&#x6548;&#x7387;&#x3001;&#x62D3;&#x5C55;&#x6027;&#x3001;&#x5BB9;&#x9519;&#x673A;&#x5236;&#xFF0C;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x4F7F;&#x7528;&#x5E94;&#x8BE5;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;</li>
<li>&#x7ECF;&#x6D4E;&#x95EE;&#x9898;&#xFF1A;&#x5F71;&#x54CD;MapReduce&#x5728;&#x516C;&#x6709;&#x4E91;&#x4E0A;&#x6709;&#x4E09;&#x79CD;&#x56E0;&#x7D20;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x5B58;&#x50A8;&#x3001;&#x901A;&#x4FE1;&#x4EE3;&#x4EF7;&#x548C;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#xFF0C;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x673A;&#x5236;&#x7684;&#x4E5F;&#x5E94;&#x8BE5;&#x7ECF;&#x6D4E;&#x578B;&#x5730;&#x52A0;&#x5165;&#x3002;</li>
<li>&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x6570;&#x636E;&#x63A5;&#x5165;&#xFF1A;&#x5BF9;&#x4E8E;MapReduce&#x7684;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x5E94;&#x5BF9;&#x635F;&#x574F;&#x7684;&#x751A;&#x81F3;&#x662F;&#x5E26;&#x6709;&#x653B;&#x51FB;&#x6027;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4FDD;&#x62A4;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x9650;&#x5236;&#x5E26;&#x6709;&#x635F;&#x574F;&#x6027;&#x7684;Mappers&#x548C;Reducers&#x7684;&#x6570;&#x636E;&#x63A5;&#x5165;&#x3002;</li>
</ul>
<h2 id="&#x4E09;&#x3001;&#x8981;&#x6C42;"><a href="#&#x4E09;&#x3001;&#x8981;&#x6C42;" class="headerlink" title="&#x4E09;&#x3001;&#x8981;&#x6C42;"></a>&#x4E09;&#x3001;&#x8981;&#x6C42;</h2><h3 id="3-1-MapReduce&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;"><a href="#3-1-MapReduce&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;" class="headerlink" title="3.1  MapReduce&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;"></a>3.1  MapReduce&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;</h3><p>&#x5728;&#x516C;&#x6709;&#x4E91;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;MapReduce&#x5904;&#x7406;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x526F;&#x672C;&#x6570;&#x636E;&#x6709;&#x7740;&#x5F88;&#x5927;&#x7684;&#x88AB;&#x653B;&#x51FB;&#x7684;&#x53EF;&#x80FD;</p>
<ul>
<li>&#x5192;&#x5145;&#x653B;&#x51FB;&#xFF1A;&#x4F1A;&#x9020;&#x6210;&#x6570;&#x636E;&#x6CC4;&#x9732;&#x3001;&#x8BA1;&#x7B97;&#x7BE1;&#x6539;&#x548C;&#x5728;&#x6570;&#x636E;&#x4E0A;&#x7684;&#x9519;&#x8BEF;&#x8BA1;&#x7B97;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x7528;&#x6237;&#x5728;&#x8D44;&#x8D39;&#x4E0A;&#x7684;&#x635F;&#x5931;&#xFF1B;</li>
<li>&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF08;DoS&#xFF09;&#x653B;&#x51FB;&#xFF1A;Dos&#x653B;&#x51FB;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x5F97;&#x8282;&#x70B9;&#x7684;&#x529F;&#x80FD;&#x5931;&#x6548;&#x548C;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#xFF0C;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x96C6;&#x7FA4;&#x7684;&#x7F51;&#x7EDC;&#x8FC7;&#x8F7D;&#x548C;&#x6846;&#x67B6;&#x7684;&#x5931;&#x6548;&#xFF1B;</li>
<li>&#x91CD;&#x653E;&#x653B;&#x51FB;&#xFF1A;&#x901A;&#x8FC7;&#x6076;&#x610F;&#x7684;&#x6B3A;&#x8BC8;&#x6027;&#x5730;&#x91CD;&#x590D;&#x6216;&#x62D6;&#x5EF6;&#x6B63;&#x5E38;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF1B;</li>
<li>&#x7A83;&#x542C;&#xFF1A;&#x5728;&#x672A;&#x7ECF;&#x6279;&#x51C6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5728;&#x4E2D;&#x95F4;&#x88AB;&#x622A;&#x83B7;&#xFF1B;</li>
<li>&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF1A;&#x6570;&#x636E;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x88AB;&#x6076;&#x610F;&#x4FEE;&#x6539;&#x3001;&#x6BC1;&#x574F;&#xFF1B;</li>
<li>&#x62D2;&#x7EDD;&#xFF1A;&#x5F53;&#x8282;&#x70B9;&#x7684;mapper&#x6216;&#x8005;reducer&#x88AB;&#x9519;&#x8BEF;&#x5730;&#x62D2;&#x7EDD;&#x5904;&#x7406;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x62D2;&#x7EDD;&#x653B;&#x51FB;&#x3002;</li>
</ul>
<h3 id="3-2-MapReduce&#x4E2D;&#x7684;&#x5B89;&#x5168;&#x8981;&#x6C42;"><a href="#3-2-MapReduce&#x4E2D;&#x7684;&#x5B89;&#x5168;&#x8981;&#x6C42;" class="headerlink" title="3.2 MapReduce&#x4E2D;&#x7684;&#x5B89;&#x5168;&#x8981;&#x6C42;"></a>3.2 MapReduce&#x4E2D;&#x7684;&#x5B89;&#x5168;&#x8981;&#x6C42;</h3><ul>
<li><strong>Mappers&#x548C;Reducers&#x7684;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF0C;&#x6388;&#x6743;&#x548C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF1A;</strong>&#x53EA;&#x6709;&#x88AB;&#x6388;&#x6743;&#x7684;&#x7528;&#x6237;&#x624D;&#x80FD;&#x6743;&#x9650;&#x591F;&#x5904;&#x7406;&#x8FD9;&#x4E9B;mapper&#x548C;reducer&#xFF0C;&#x5BF9;&#x4E8E;&#x6388;&#x6743;&#x7684;&#x653B;&#x51FB;&#x662F;&#x5192;&#x5145;&#x653B;&#x51FB;&#x548C;&#x91CD;&#x653E;&#x653B;&#x51FB;&#xFF1B;</li>
<li><strong>&#x6570;&#x636E;&#x3001;mapper&#x548C;reducer&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF1A;</strong>&#x6570;&#x636E;&#x3001;mapper&#x548C;reducer&#x5BF9;&#x4E8E;&#x6388;&#x6743;&#x7684;&#x7528;&#x6237;&#x662F;&#x6CA1;&#x6709;&#x5EF6;&#x8FDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x653B;&#x51FB;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x6709;&#x5F71;&#x54CD;&#x7684;&#xFF1B;</li>
<li><strong>&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x7684;&#x4FDD;&#x5BC6;&#x6027;&#xFF1A;</strong>&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x673A;&#x5BC6;&#x6027;&#xFF0C;&#x5728;&#x4F20;&#x8F93;&#x671F;&#x95F4;&#x548C;&#x5728;&#x516C;&#x5171;&#x4E91;&#x672C;&#x8EAB;&#x4E0A;&#x4F20;&#x8F93;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x80FD;&#x62E6;&#x622A;&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x3002;</li>
<li><strong>&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF1A;</strong>&#x8BA1;&#x7B97;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x662F;&#x6307;&#x516C;&#x5E73;&#x4F20;&#x8F93;&#xFF08;&#x6307;&#x7684;&#x662F;&#x4ECE;&#x7528;&#x6237;&#x4F4D;&#x7F6E;&#x5230;&#x8BA1;&#x7B97;&#x4F4D;&#x7F6E;&#x7684;MapReduce&#x8BA1;&#x7B97;&#xFF09;&#x4EE5;&#x53CA;Mappers&#x548C;Reducers&#x7684;&#x6267;&#x884C;&#x3002;</li>
<li><strong>&#x9A8C;&#x8BC1;&#x8F93;&#x51FA;&#xFF1A;</strong>&#x9A8C;&#x8BC1;&#x786E;&#x4FDD;&#x4E86;&#x8F93;&#x51FA;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x3001;&#x6B63;&#x786E;&#x6027;&#x3001;&#x53CA;&#x65F6;&#x6027;&#xFF1B;</li>
<li><strong>&#x5BF9;&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x7684;&#x6838;&#x7B97;&#x548C;&#x5BA1;&#x6838;</strong></li>
</ul>
<h2 id="3-3-&#x5BF9;&#x4E8E;MapReduce&#x5B89;&#x5168;&#x7684;&#x5BF9;&#x6297;&#x6A21;&#x578B;"><a href="#3-3-&#x5BF9;&#x4E8E;MapReduce&#x5B89;&#x5168;&#x7684;&#x5BF9;&#x6297;&#x6A21;&#x578B;" class="headerlink" title="3.3 &#x5BF9;&#x4E8E;MapReduce&#x5B89;&#x5168;&#x7684;&#x5BF9;&#x6297;&#x6A21;&#x578B;"></a>3.3 &#x5BF9;&#x4E8E;MapReduce&#x5B89;&#x5168;&#x7684;&#x5BF9;&#x6297;&#x6A21;&#x578B;</h2><ul>
<li><strong>Honest-but-curious adversary&#xFF1A;</strong>&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x5B9A;&#x7684;&#x989D;&#x5916;&#x8BA1;&#x7B97;&#xFF1B;</li>
<li><strong>Malicious adversary&#xFF1A;</strong>&#x5E94;&#x5BF9;&#x7A83;&#x53D6;&#x3001;&#x6BC1;&#x574F;&#x3001;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;<ul>
<li>non-collusive &#xFF1A;&#x72EC;&#x7ACB;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x534F;&#x4F5C;&#xFF1B;</li>
<li>collusive&#xFF1A;&#x5728;&#x7ED9;&#x51FA;&#x8F93;&#x51FA;&#x4E4B;&#x524D;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x6240;&#x4EE5;&#x7684;&#x4E00;&#x8D77;&#x901A;&#x4FE1;&#xFF1B;</li>
</ul>
</li>
<li><strong>Knowledgeable adversary&#xFF1A;</strong>&#x5177;&#x6709;&#x63D0;&#x5347;&#x5B89;&#x5168;&#x6027;&#x7684;&#x80FD;&#x529B;&#xFF1B;</li>
<li><strong>Network and nodes access adversary&#xFF1A;</strong></li>
</ul>
<h3 id="3-4-MapReduce&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;"><a href="#3-4-MapReduce&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;" class="headerlink" title="3.4 MapReduce&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;"></a>3.4 MapReduce&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;</h3><div align="center"><br><img src="http://poimikjf2.bkt.clouddn.com/img/20190318203110.png"><br></div>





<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-03-14T15:50:35.000Z">2019-03-14</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    7 minutes read (About 1102 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/03/14/论文笔记03：H-Scheduler Storage-Aware Task Scheduling for Heterogeneous-Storage Spark Clusters/">论文笔记03：H-Scheduler Storage-Aware Task Scheduling for Heterogeneous-Storage Spark Clusters</a>
            
        </h1>
        <div class="content">
            <p>&#x53D1;&#x8868;&#x4E8E;2018</p>
<h2 id="&#x4E00;&#x3001;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;"><a href="#&#x4E00;&#x3001;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x4E00;&#x3001;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;"></a>&#x4E00;&#x3001;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;</h2><p>Spark&#x96C6;&#x7FA4;&#x5728;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#xFF08;HDDs &#x548C; SSDs&#xFF09;&#x5F02;&#x6784;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7ED3;&#x70B9;&#x7684;&#x8BFB;&#x5199;&#x901F;&#x5EA6;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6CA1;&#x6709;&#x5145;&#x5206;&#x5730;&#x5229;&#x7528;&#x5F02;&#x6784;&#x5B58;&#x50A8;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x5F53;&#x524D;&#x9488;&#x5BF9;&#x4E8E;&#x5F02;&#x6784;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x8C03;&#x5EA6;&#xFF0C;&#x53EA;&#x8003;&#x8651;&#x4E86;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x5FFD;&#x89C6;&#x4E86;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x5F02;&#x6784;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"></a>&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</h2><h3 id="2-1-&#x521B;&#x65B0;&#x70B9;"><a href="#2-1-&#x521B;&#x65B0;&#x70B9;" class="headerlink" title="2.1 &#x521B;&#x65B0;&#x70B9;"></a>2.1 &#x521B;&#x65B0;&#x70B9;</h3><p>&#x8003;&#x8651;Spark&#x96C6;&#x7FA4;&#x4E0A;<strong>&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;&#x4E0D;&#x540C;</strong>&#x5BF9;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x5BF9;&#x4E8E;&#x5F02;&#x6784;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x96C6;&#x7FA4;&#x5B58;&#x50A8;&#x611F;&#x77E5;&#x7684;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x3002;</p>
<h3 id="2-2-&#x7ED3;&#x679C;"><a href="#2-2-&#x7ED3;&#x679C;" class="headerlink" title="2.2 &#x7ED3;&#x679C;"></a>2.2 &#x7ED3;&#x679C;</h3><p>&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x663E;&#x793A;&#xFF0C;H-Scheduler&#x80FD;&#x591F;&#x964D;&#x4F4E;Job 73.6%&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x80CC;&#x666F;-amp-&#x52A8;&#x673A;"><a href="#&#x4E09;&#x3001;&#x80CC;&#x666F;-amp-&#x52A8;&#x673A;" class="headerlink" title="&#x4E09;&#x3001;&#x80CC;&#x666F;&amp;&#x52A8;&#x673A;"></a>&#x4E09;&#x3001;&#x80CC;&#x666F;&amp;&#x52A8;&#x673A;</h2><ul>
<li>&#x652F;&#x6301;&#x5F02;&#x6784;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;HDFS&#xFF1B;</li>
<li>&#x652F;&#x6301;&#x5F02;&#x6784;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;HDFS&#x548C;&#x5F53;&#x524D;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x7684;&#x5339;&#x914D;&#xFF1A;</li>
<li>&#x7531;&#x4E8E;&#x7F51;&#x901F;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7684;&#x5F71;&#x54CD;&#x5BF9;&#x4E8E;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7684;&#x5F71;&#x54CD;&#x5728;&#x964D;&#x4F4E;&#xFF1B;</li>
</ul>
<h2 id="&#x56DB;&#x3001;&#x8BBE;&#x8BA1;"><a href="#&#x56DB;&#x3001;&#x8BBE;&#x8BA1;" class="headerlink" title="&#x56DB;&#x3001;&#x8BBE;&#x8BA1;"></a>&#x56DB;&#x3001;&#x8BBE;&#x8BA1;</h2><p>H-Scheduler&#x5728;&#x8C03;&#x5EA6;&#x51B3;&#x7B56;&#x540C;&#x65F6;&#x8003;&#x8651;&#x5C06;<strong>&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;</strong>&#x548C;<strong>&#x5B58;&#x50A8;&#x4ECB;&#x8D28;</strong>&#x7C7B;&#x578B;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x3002;</p>
<h3 id="&#x7B2C;&#x4E00;&#x6B65;-&#x4EFB;&#x52A1;&#x5206;&#x7C7B;"><a href="#&#x7B2C;&#x4E00;&#x6B65;-&#x4EFB;&#x52A1;&#x5206;&#x7C7B;" class="headerlink" title="&#x7B2C;&#x4E00;&#x6B65; &#x4EFB;&#x52A1;&#x5206;&#x7C7B;"></a>&#x7B2C;&#x4E00;&#x6B65; &#x4EFB;&#x52A1;&#x5206;&#x7C7B;</h3><p>H-Scheduler&#x5728;&#x8C03;&#x5EA6;&#x4E4B;&#x524D;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x5904;&#x7406;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7C7B;&#x578B;&#xFF0C;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x7684;&#x672C;&#x5730;&#x6027;&#x548C;&#x6570;&#x636E;&#x5757;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;&#x7C7B;&#x578B;&#x5C06;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x56DB;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;</p>
<ol>
<li>SSD task</li>
<li>remote SSD task</li>
<li>local HDD task</li>
<li>remote HDD task</li>
</ol>
<p>&#x56DB;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4F9D;&#x6B21;&#x9012;&#x589E;</p>
<p>&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x6210;SSD&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x548C;HDD&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x4E24;&#x5927;&#x7C7B;</p>
<h3 id="&#x7B2C;&#x4E8C;&#x6B65;-&#x4EFB;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;"><a href="#&#x7B2C;&#x4E8C;&#x6B65;-&#x4EFB;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x6B65; &#x4EFB;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;"></a>&#x7B2C;&#x4E8C;&#x6B65; &#x4EFB;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;</h3><p>&#x6839;&#x636E;&#x56DB;&#x79CD;&#x4EFB;&#x52A1;&#x7C7B;&#x578B;&#x6765;&#x51B3;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;<br>&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;&#xFF1A;</p>
<p> local SSD task &gt; local HDD task &gt; remote HDD task &gt; remote SSD task.</p>
<h3 id="&#x7B2C;&#x4E09;&#x6B65;-&#x8282;&#x70B9;&#x7684;&#x9009;&#x62E9;"><a href="#&#x7B2C;&#x4E09;&#x6B65;-&#x8282;&#x70B9;&#x7684;&#x9009;&#x62E9;" class="headerlink" title="&#x7B2C;&#x4E09;&#x6B65; &#x8282;&#x70B9;&#x7684;&#x9009;&#x62E9;"></a>&#x7B2C;&#x4E09;&#x6B65; &#x8282;&#x70B9;&#x7684;&#x9009;&#x62E9;</h3><p>&#x5728;&#x9009;&#x62E9;&#x6267;&#x884C;&#x8FDC;&#x7A0B;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x7B56;&#x7565;&#xFF1A;</p>
<ol>
<li>&#x968F;&#x673A;&#x9009;&#x62E9;</li>
<li>&#x6700;&#x591A;&#x4F18;&#x5148;&#x9009;&#x62E9;&#xFF1A;&#x9009;&#x62E9;&#x62E5;&#x6709;&#x672C;&#x5730;&#x4EFB;&#x52A1;&#x6700;&#x591A;&#x7684;&#x8282;&#x70B9;</li>
<li>&#x6700;&#x5C11;&#x4F18;&#x5148;&#x9009;&#x62E9;&#xFF1A;&#x9009;&#x62E9;&#x62E5;&#x6709;&#x672C;&#x5730;&#x4EFB;&#x52A1;&#x6700;&#x5C11;&#x7684;&#x8282;&#x70B9;</li>
</ol>
<h2 id="&#x4E94;&#x3001;&#x7B97;&#x6CD5;"><a href="#&#x4E94;&#x3001;&#x7B97;&#x6CD5;" class="headerlink" title="&#x4E94;&#x3001;&#x7B97;&#x6CD5;"></a>&#x4E94;&#x3001;&#x7B97;&#x6CD5;</h2><h3 id="&#x7B97;&#x6CD5;1"><a href="#&#x7B97;&#x6CD5;1" class="headerlink" title="&#x7B97;&#x6CD5;1"></a>&#x7B97;&#x6CD5;1</h3><div align="center"><br>    <img src="http://poimikjf2.bkt.clouddn.com/blog/20190317/nHPDdDtCgEXP.png?imageslim"><br></div>


<p>&#x9002;&#x5408;&#x7684;&#x4E24;&#x4E2A;&#x573A;&#x666F;&#xFF1A;</p>
<ol>
<li>&#x5DE5;&#x4F5C;&#x91CF;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x7684;&#xFF0C;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x5F88;&#x5927;&#xFF1B;</li>
<li>&#x80FD;&#x8017;&#x4F4E;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#xFF0C;&#x5BF9;&#x4E8E;SLA&#x622A;&#x6B62;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x8F83;&#x4F4E;&#x3002;</li>
</ol>
<h2 id="&#x516D;&#x3001;&#x5B9E;&#x9A8C;"><a href="#&#x516D;&#x3001;&#x5B9E;&#x9A8C;" class="headerlink" title="&#x516D;&#x3001;&#x5B9E;&#x9A8C;"></a>&#x516D;&#x3001;&#x5B9E;&#x9A8C;</h2><p>&#x56DB;&#x79CD;&#x5178;&#x578B;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#xFF1A;</p>
<ul>
<li>Wordcount(500GB)&#xFF1A;CPU&#x5BC6;&#x96C6;&#x578B;&#x4EFB;&#x52A1;</li>
<li>Sort(400GB)&#xFF1A;Shuffle&#x5BC6;&#x96C6;&#x578B;&#x4EFB;&#x52A1;</li>
<li>Grep(600GB)&#xFF1A;I/O&#x5BC6;&#x96C6;&#x578B;&#x4EFB;&#x52A1;</li>
<li>TPC-H&#xFF1A;I/O&#x5BC6;&#x96C6;&#x578B;&#x4EFB;&#x52A1;</li>
</ul>
<p>&#x4E09;&#x79CD;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF1A;</p>
<ul>
<li>Original:&#x53EA;&#x8003;&#x8651;&#x4E86;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x800C;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;&#x5DEE;&#x5F02;&#xFF1B;</li>
<li>Storage-type&#xFF1A;&#x53EA;&#x8003;&#x8651;&#x4E86;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;&#x5DEE;&#x5F02;&#x800C;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#xFF1B;</li>
<li>H-Scheduler&#xFF1A;&#x65E2;&#x8003;&#x8651;&#x4E86;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x53C8;&#x8003;&#x8651;&#x4E86;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x7684;&#x5DEE;&#x5F02;&#x3002;</li>
</ul>
<p>&#x5206;&#x522B;&#x8BC4;&#x4F30;&#x4E86;&#x4E24;&#x79CD;job&#xFF1A;</p>
<ul>
<li>Single job on cluster:</li>
<li>Multiple jobs on cluster&#xFF1A;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x4E09;&#x4E2A;job</li>
</ul>
<p>&#x5F71;&#x54CD;H-Scheduler&#x7684;&#x4E09;&#x4E2A;&#x91CD;&#x8981;&#x53C2;&#x6570;&#xFF1A;</p>
<ul>
<li>SSD &#x4EFB;&#x52A1;&#x7684;&#x6BD4;&#x4F8B;&#xFF1A;&#x6BD4;&#x4F8B;&#x8D8A;&#x9AD8;&#xFF0C;&#x6027;&#x80FD;&#x8D8A;&#x597D;</li>
<li>SSD&#x7684;&#x526F;&#x672C;&#x6570;&#x76EE;&#xFF1A;</li>
<li>SSD task&#xFF0C;remote SSD task&#x548C;HDD task&#x4E4B;&#x95F4;&#x65F6;&#x95F4;&#x7684;&#x6BD4;&#x4F8B;</li>
</ul>
<h2 id="&#x4E03;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;"><a href="#&#x4E03;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;" class="headerlink" title="&#x4E03;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;"></a>&#x4E03;&#x3001;&#x76F8;&#x5173;&#x7814;&#x7A76;</h2><p>&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x5728;&#x5927;&#x6570;&#x636E;&#x5904;&#x7406;&#x5E73;&#x53F0;&#x4E0A;&#x5904;&#x7406;&#x7B56;&#x7565;&#xFF1A;</p>
<h3 id="&#x63D0;&#x5347;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7A0B;&#x5EA6;"><a href="#&#x63D0;&#x5347;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7A0B;&#x5EA6;" class="headerlink" title="&#x63D0;&#x5347;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7A0B;&#x5EA6;"></a>&#x63D0;&#x5347;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7A0B;&#x5EA6;</h3><p>&#x901A;&#x8FC7;&#x63D0;&#x5347;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7684;&#x7A0B;&#x5EA6;&#x6765;&#x63D0;&#x5347;&#x5927;&#x6570;&#x636E;&#x5E73;&#x53F0;&#x7684;&#x5904;&#x7406;&#x6027;&#x80FD;</p>
<table>
<thead>
<tr>
<th>&#x5904;&#x7406;&#x65B9;&#x6CD5;</th>
<th>&#x6587;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x901A;&#x8FC7;&#x5EF6;&#x8FDF;&#x8C03;&#x5EA6;&#x6765;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x672C;&#x5730;&#x5316;&#x7A0B;&#x5EA6;</td>
<td>[11]</td>
</tr>
<tr>
<td>&#x4ECE;&#x968F;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x89D2;&#x5EA6;&#x8003;&#x8651;map&#x4EFB;&#x52A1;&#x672C;&#x5730;&#x5316;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6392;&#x961F;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x540C;&#x65F6;&#x6700;&#x5927;&#x5316;&#x541E;&#x5410;&#x91CF;&#x5E76;&#x6700;&#x5C0F;&#x5316;&#x91CD;&#x8D1F;&#x8F7D;&#x6761;&#x4EF6;&#x4E0B;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</td>
<td>[24]</td>
</tr>
<tr>
<td>&#x901A;&#x8FC7;&#x590D;&#x5236;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;</td>
<td>[12],[16]</td>
</tr>
</tbody>
</table>
<h3 id="&#x5904;&#x7406;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;"><a href="#&#x5904;&#x7406;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;" class="headerlink" title="&#x5904;&#x7406;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;"></a>&#x5904;&#x7406;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;</h3><table>
<thead>
<tr>
<th>&#x5904;&#x7406;&#x65B9;&#x6CD5;</th>
<th>&#x6587;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x9996;&#x6B21;&#x8003;&#x8651;&#x5F02;&#x6784;&#x95EE;&#x9898;&#x5E76;&#x91C7;&#x53D6;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#x7684;&#x8FDB;&#x5EA6;</td>
<td>[17]</td>
</tr>
<tr>
<td>&#x63A2;&#x8BA8;&#x843D;&#x540E;&#x8005;/&#x5F02;&#x5E38;&#x503C;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x65E9;&#x671F;&#x53D1;&#x5C55;&#x539F;&#x56E0;&#x548C;&#x8D44;&#x6E90;&#x611F;&#x77E5;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x66F4;&#x667A;&#x80FD;&#x5730;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x503C;&#x3002;</td>
<td>[19]</td>
</tr>
<tr>
<td>&#x5229;&#x7528;&#x5386;&#x53F2;&#x4FE1;&#x606F;&#x6765;&#x8C03;&#x6574;Map&#x548C;Reduce&#x9636;&#x6BB5;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x4F30;&#x8BA1;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x65F6;&#x95F4;</td>
<td>[18]</td>
</tr>
<tr>
<td>&#x4F7F;&#x7528;K-means&#x7B97;&#x6CD5;&#x5BF9;&#x5386;&#x53F2;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x6765;&#x63D0;&#x5347;&#x5BF9;&#x4E8E;&#x4EFB;&#x52A1;&#x9636;&#x6BB5;&#x6743;&#x91CD;&#x8BC4;&#x4F30;&#x7684;&#x51C6;&#x786E;&#x6027;</td>
<td>[25]</td>
</tr>
<tr>
<td>&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x8D1F;&#x8F7D;&#x91CD;&#x65B0;&#x5E73;&#x8861;&#xFF08;&#x66F4;&#x5FEB;&#x7684;&#x8282;&#x70B9;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF09;&#x6765;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;</td>
<td>[20],[21]</td>
</tr>
</tbody>
</table>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-03-14T15:50:20.000Z">2019-03-14</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    8 minutes read (About 1176 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/03/14/论文笔记02：Comparative Analysis of Energy-Efficient Scheduling Algorithms for Big Data Applications/">论文笔记02：Comparative Analysis of Energy-Efficient Scheduling Algorithms for Big Data Applications</a>
            
        </h1>
        <div class="content">
            <p>&#x53D1;&#x8868;&#x4E8E;2018.7</p>
<h2 id="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"><a href="#&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;"></a>&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</h2><p>Spark&#x96C6;&#x7FA4;&#x5728;&#x53CD;&#x7F51;&#x7EDC;&#x72AF;&#x7F6A;&#x4E2D;&#x7684;&#x80FD;&#x8017;&#x95EE;&#x9898;</p>
<h2 id="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;"></a>&#x4E8C;&#x3001;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;</h2><h3 id="2-1-&#x521B;&#x65B0;&#x70B9;"><a href="#2-1-&#x521B;&#x65B0;&#x70B9;" class="headerlink" title="2.1 &#x521B;&#x65B0;&#x70B9;"></a>2.1 &#x521B;&#x65B0;&#x70B9;</h3><p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x670D;&#x52A1;&#x7EA7;&#x522B;&#x534F;&#x8BAE;&#x8FDD;&#x53CD;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x6700;&#x4F18;&#x7684;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x5177;&#x6709;&#x901A;&#x8FC7;&#x6743;&#x8861;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x548C;&#x80FD;&#x91CF;&#x6D88;&#x8017;&#x7684;&#x6700;&#x540E;&#x671F;&#x9650;&#x7EA6;&#x675F;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x53BB;&#x6700;&#x5C0F;&#x5316;&#x5927;&#x6570;&#x636E;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x80FD;&#x8017;&#x95EE;&#x9898;&#x3002;&#x8BE5;&#x6700;&#x4F18;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x627E;&#x5230;&#x63A5;&#x8FD1;&#x6700;&#x4F18;&#x7684;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#xFF0C;&#x4EE5;&#x5728;&#x5C0F;&#x7684;shuffle&#x5206;&#x533A;&#x4E2D;&#x6743;&#x8861;&#x6D88;&#x8017;&#x7684;&#x80FD;&#x91CF;&#x548C;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x4F18;&#x52BF;&#x3002;</p>
<h3 id="2-2-&#x7ED3;&#x679C;"><a href="#2-2-&#x7ED3;&#x679C;" class="headerlink" title="2.2 &#x7ED3;&#x679C;"></a>2.2 &#x7ED3;&#x679C;</h3><p>&#x5BF9;&#x6BD4;Spark&#x5185;&#x5D4C;&#x7684;FIFO&#x548C;FAIR&#x7B97;&#x6CD5;&#xFF0C;&#x80FD;&#x8017;&#x4E0A;&#x90FD;&#x6709;&#x4F18;&#x5316;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x52A8;&#x673A;"><a href="#&#x4E09;&#x3001;&#x52A8;&#x673A;" class="headerlink" title="&#x4E09;&#x3001;&#x52A8;&#x673A;"></a>&#x4E09;&#x3001;&#x52A8;&#x673A;</h2><ul>
<li>&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x5473;&#x964D;&#x4F4E;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;&#x800C;&#x5728;&#x662F;&#x622A;&#x6B62;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x4E4B;&#x524D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6309;&#x9700;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5173;&#x5FC3;&#x662F;&#x80FD;&#x8017;&#x4E0A;&#x7684;&#x4F18;&#x5316;&#x3002;</li>
</ul>
<h2 id="&#x56DB;&#x3001;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;"><a href="#&#x56DB;&#x3001;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;" class="headerlink" title="&#x56DB;&#x3001;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;"></a>&#x56DB;&#x3001;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</h2><table>
<thead>
<tr>
<th>&#x8003;&#x8651;&#x7684;&#x4E3B;&#x8981;&#x56E0;&#x7D20;</th>
<th>&#x6587;&#x7AE0;</th>
<th>&#x65B9;&#x6CD5;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x4E91;&#x8BA1;&#x7B97;&#x5F53;&#x4E2D;&#x4F18;&#x5316;&#x7269;&#x7406;&#x673A;&#x4E0A;&#x7684;&#x80FD;&#x8017;&#x95EE;&#x9898;</td>
<td></td>
<td></td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[14]</td>
<td>&#x63D0;&#x51FA;&#x4E86;&#x8003;&#x8651;CPU,&#x78C1;&#x76D8;&#xFF0C;&#x5185;&#x5B58;&#xFF0C;&#x7F51;&#x7EDC;&#x5BF9;&#x4E8E;&#x5200;&#x7247;&#x670D;&#x52A1;&#x5668;&#x7684;&#x80FD;&#x8017;&#x6A21;&#x578B;</td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[16]</td>
<td>&#x63D0;&#x51FA;&#x4E86;&#x8003;&#x8651;CPU,&#x78C1;&#x76D8;&#xFF0C;&#x5185;&#x5B58;&#xFF0C;&#x7F51;&#x7EDC;&#xFF0C;&#x98CE;&#x6247;&#x5BF9;&#x6240;&#x6709;&#x670D;&#x52A1;&#x5668;&#x7684;&#x80FD;&#x8017;&#x7684;&#x76F4;&#x63A5;&#x6D4B;&#x91CF;</td>
</tr>
<tr>
<td>Spark&#x8C03;&#x5EA6;&#x4E2D;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x5DE5;&#x4F5C;&#x6267;&#x884C;&#x7684;&#x5B8C;&#x5DE5;&#x65F6;&#x95F4;</td>
<td></td>
<td></td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[6]</td>
<td>&#x4ED6;&#x4EEC;&#x6A21;&#x62DF;&#x4E86;&#x6267;&#x884C;&#x5668;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6210;&#x672C;&#x548C;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x63D0;&#x4F9B;&#x4E86;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x65B9;&#x6848;</td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[19]</td>
<td>&#x901A;&#x8FC7;&#x6536;&#x96C6;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4E0B;&#x7684;&#x4E0D;&#x540C;stage&#x6267;&#x884C;&#x65F6;&#x95F4;&#x6765;&#x9884;&#x6D4B;&#x5E94;&#x7528;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;</td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[20]</td>
<td>&#x63D0;&#x51FA;&#x4E86;&#x57FA;&#x4E8E;&#x8F93;&#x5165;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x5E95;&#x5C42;&#x96C6;&#x7FA4;&#x8282;&#x70B9;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x7684;&#x4F5C;&#x4E1A;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x6A21;&#x578B;&#x3002;</td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[18]</td>
<td>&#x4E3A;&#x4E86;&#x9884;&#x6D4B;&#x5177;&#x6709;&#x672A;&#x77E5;&#x7FA4;&#x96C6;&#x914D;&#x7F6E;&#x7684;&#x5927;&#x6570;&#x636E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x51FA;&#x57FA;&#x4E8E;&#x5E94;&#x7528;&#x7B80;&#x6863;&#x6570;&#x636E;&#x6784;&#x5EFA;&#x591A;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x6A21;&#x578B;</td>
</tr>
<tr>
<td>&#x2014;</td>
<td>[21]</td>
<td>&#x4E3A;Spark&#x5728;&#x7EBF;&#x5206;&#x6790;&#x63D0;&#x4F9B;QoS&#x4FDD;&#x8BC1;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x57FA;&#x4E8E;&#x71B5;&#x5728;&#x7EBF;&#x5E76;&#x884C;&#x5206;&#x6790;&#x8C03;&#x5EA6;</td>
</tr>
</tbody>
</table>
<p>&#x5E94;&#x5BF9;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x6311;&#x6218;&#x7684;&#x4E09;&#x79CD;&#x5E94;&#x5BF9;&#x7B56;&#x7565;&#xFF1A;</p>
<ul>
<li>Spark&#x7684;executors&#x4E3A;&#x4E86;&#x53CA;&#x65F6;&#x6EE1;&#x8DB3;&#x5B83;&#x4EEC;&#x8D44;&#x6E90;&#x9884;&#x7559;&#x5E94;&#x5C06;&#x88AB;&#x653E;&#x7F6E;&#x5230;&#x5408;&#x9002;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x907F;&#x514D;&#x592A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x7B49;&#x5F85;&#x548C;&#x4F4E;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#xFF1B;</li>
<li>&#x5206;&#x914D;&#x7528;&#x4E8E;&#x51CF;&#x5C11;&#x4EFB;&#x52A1;&#x7684;&#x8D44;&#x6E90;&#x5E94;&#x6839;&#x636E;&#x5176;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x5E73;&#x8861;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5728;&#x5C06;&#x4EFB;&#x4F55;Spark&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4EA4;&#x5230;&#x7FA4;&#x96C6;&#x65F6;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#xFF1B;</li>
<li>&#x5728;&#x8003;&#x8651;Spark&#x548C;MapReduce&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F4D;&#x7F6E;&#x611F;&#x77E5;&#x7684;&#x65F6;&#x5019;,&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5C40;&#x90E8;&#x6027;&#x611F;&#x77E5;&#x7684;&#x7ADE;&#x4E89;,Spark&#x548C;MapReduce&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x7B56;&#x7565;&#x90FD;&#x5E94;&#x8BE5;&#x4F18;&#x5316;&#x3002;</li>
</ul>
<h2 id="&#x4E94;&#x3001;&#x7B97;&#x6CD5;"><a href="#&#x4E94;&#x3001;&#x7B97;&#x6CD5;" class="headerlink" title="&#x4E94;&#x3001;&#x7B97;&#x6CD5;"></a>&#x4E94;&#x3001;&#x7B97;&#x6CD5;</h2><h3 id="&#x7B97;&#x6CD5;1"><a href="#&#x7B97;&#x6CD5;1" class="headerlink" title="&#x7B97;&#x6CD5;1"></a>&#x7B97;&#x6CD5;1</h3><div align="center"><br>    <img src="http://poimikjf2.bkt.clouddn.com/blog/20190317/ywsm41dFB8Fr.png?imageslim"><br></div>




<p>&#x9002;&#x5408;&#x7684;&#x4E24;&#x4E2A;&#x573A;&#x666F;&#xFF1A;</p>
<ol>
<li>&#x5DE5;&#x4F5C;&#x91CF;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x7684;&#xFF0C;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x5F88;&#x5927;&#xFF1B;</li>
<li>&#x80FD;&#x8017;&#x4F4E;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#xFF0C;&#x5BF9;&#x4E8E;SLA&#x622A;&#x6B62;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x8F83;&#x4F4E;&#x3002;</li>
</ol>
<h3 id="&#x7B97;&#x6CD5;2"><a href="#&#x7B97;&#x6CD5;2" class="headerlink" title="&#x7B97;&#x6CD5;2"></a>&#x7B97;&#x6CD5;2</h3><p>&#x7B97;&#x6CD5;B&#x6743;&#x8861;&#x80FD;&#x8017;&#x548C;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x7279;&#x522B;&#x5BF9;&#x4E8E;&#x5C0F;shuffle&#x7684;&#x5206;&#x533A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
<p>&#x5728;&#x5C0F;&#x5206;&#x533A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7B97;&#x6CD5;B&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x7ED9;&#x96C6;&#x7FA4;&#x4E2D;&#x6700;&#x4F73;&#x7684;&#x4E00;&#x534A;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x5E73;&#x8861;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x53E6;&#x4E00;&#x534A;&#x4E2D;&#x82B1;&#x8D39;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="&#x7B97;&#x6CD5;3"><a href="#&#x7B97;&#x6CD5;3" class="headerlink" title="&#x7B97;&#x6CD5;3"></a>&#x7B97;&#x6CD5;3</h3><p>&#x7B97;&#x6CD5;3&#x5C06;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x96C6;&#x5408;&#xFF1A;</p>
<ul>
<li>Set0&#xFF1A;&#x5305;&#x542B;&#x6240;&#x6709;&#x9700;&#x8981;&#x88AB;&#x63A2;&#x6D4B;&#x7684;&#x4EFB;&#x52A1;&#x548C;&#x5F53;&#x524D;p&#x548C;e&#x4E3A;0&#x7684;&#x4EFB;&#x52A1;&#xFF1B;</li>
<li>Distribute&#xFF1A;&#x5305;&#x542B;&#x90A3;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x63A2;&#x6D4B;&#x7684;&#x4EFB;&#x52A1;&#x3002;</li>
</ul>
<p>RunTimeEachExe&#xFF1A;&#x8BB0;&#x5F55;&#x7740;&#x6700;&#x4F18;&#x90E8;&#x5206;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;</p>
<h2 id="&#x516D;&#x3001;&#x5B9E;&#x9A8C;"><a href="#&#x516D;&#x3001;&#x5B9E;&#x9A8C;" class="headerlink" title="&#x516D;&#x3001;&#x5B9E;&#x9A8C;"></a>&#x516D;&#x3001;&#x5B9E;&#x9A8C;</h2><p>&#x57FA;&#x4E8E;<a href="https://www.ibm.com/support/knowledgecenter/en/SSZUMP_7.2.1/mapreduce_integration/map_reduce_hibench.html" target="_blank" rel="noopener">HiBench</a>&#x7684;&#x57FA;&#x51C6;&#x5B9E;&#x9A8C;&#xFF0C;&#x5728;&#x4E09;&#x79CD;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x4E0A;&#x5B9E;&#x9A8C;&#xFF1A;</p>
<ul>
<li>Sort</li>
<li>TeraSort </li>
<li>PageRank</li>
</ul>
<h2 id="&#x4E03;&#x3001;&#x7ED3;&#x679C;&#x5206;&#x6790;"><a href="#&#x4E03;&#x3001;&#x7ED3;&#x679C;&#x5206;&#x6790;" class="headerlink" title="&#x4E03;&#x3001;&#x7ED3;&#x679C;&#x5206;&#x6790;"></a>&#x4E03;&#x3001;&#x7ED3;&#x679C;&#x5206;&#x6790;</h2><p>&#x7B97;&#x6CD5;B&#x5728;&#x4FDD;&#x8BC1;&#x6709;&#x6548;&#x964D;&#x4F4E;&#x80FD;&#x8017;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4F18;&#x5316;&#x4E86;&#x7B97;&#x6CD5;A&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x4E3A;&#x57FA;&#x4E8E;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x7684;&#x7B97;&#x6CD5;A&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x7ED9;&#x8BC4;&#x4F30;&#x6807;&#x51C6;&#x7684;&#x6700;&#x4F73;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BFC;&#x81F4;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8FC7;&#x8F7D;&#x5E76;&#x56E0;&#x6B64;&#x5BFC;&#x81F4;&#x603B;&#x4F53;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x589E;&#x52A0;&#x3002;</p>
<p>&#x7B97;&#x6CD5;B&#x4F7F;&#x5F97;Shuffle&#x5206;&#x533A;&#x7684;&#x6570;&#x91CF;&#x4ECE;10&#x5230;40&#x53D8;&#x5316;&#xFF0C;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x96C6;&#x7FA4;&#x4E2D;&#x4E00;&#x534A;&#x7684;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7B97;&#x6CD5;B&#x51CF;&#x5C11;&#x4E86;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x52A0;&#x5FEB;&#x4E86;&#x4F5C;&#x4E1A;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7B97;&#x6CD5;B&#x7684;&#x4E24;&#x70B9;&#x6539;&#x8FDB;&#xFF1A;</p>
<ul>
<li>&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x7B56;&#x7565;</li>
<li>&#x4E0D;&#x8003;&#x8651;&#x6570;&#x636E;&#x5C40;&#x90E8;&#x6027;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x5747;&#x5300;&#x5730;&#x5206;&#x5E03;&#x5230;&#x6700;&#x4F73;&#x7684;&#x4E00;&#x534A;&#x8FC7;&#x7A0B;</li>
</ul>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x7B97;&#x6CD5;B&#x66F4;&#x52A0;&#x9002;&#x5408;&#x7684;&#x573A;&#x666F;&#xFF1A;</p>
<ul>
<li>&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x66F4;&#x5C11;&#x7684;&#x4EFB;&#x52A1;</li>
<li>SLA&#x7684;&#x622A;&#x6B62;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#xFF0C;&#x8282;&#x80FD;&#x8981;&#x6C42;&#x8F83;&#x4E3A;&#x5BBD;&#x677E;</li>
</ul>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








</div>
                




<div class="column is-4-tablet is-4-desktop is-3-widescreen  has-order-1 column-left ">
    
        
<div class="card widget">
    <div class="card-content">
        <nav class="level">
            <div class="level-item has-text-centered">
                <div>
                    
                        <figure class="image is-128x128 has-mb-6">
                            <img class="is-rounded" src="https://gitee.com/IvanLu1024/picts/raw/master/personal/IMG_ivan.jpg" alt="Ivan Lu">
                        </figure>
                    
                    
                    <p class="is-size-4 is-block">
                        Ivan Lu
                    </p>
                    
                    
                    <p class="is-size-6 is-block">
                        Student
                    </p>
                    
                    
                    <p class="is-size-6 is-flex is-flex-center has-text-grey">
                        <i class="fas fa-map-marker-alt has-mr-7"></i>
                        <span>Nanjing,China</span>
                    </p>
                    
                </div>
            </div>
        </nav>
        <nav class="level is-mobile">
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Entradas
                    </p>
                    <p class="title has-text-weight-normal">
                        19
                    </p>
                </div>
            </div>
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Categoria
                    </p>
                    <p class="title has-text-weight-normal">
                        1
                    </p>
                </div>
            </div>
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Etiquetas
                    </p>
                    <p class="title has-text-weight-normal">
                        16
                    </p>
                </div>
            </div>
        </nav>
        <div class="level">
            <a class="level-item button is-link is-rounded" href="https://github.com/IvanLu1024" target="_blank">
                SEGUIR</a>
        </div>
        
        
        <div class="level is-mobile">
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Github" href="https://github.com/IvanLu1024">
                
                <i class="fab fa-github"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Facebook" href="https://facebook.com">
                
                <i class="fab fa-facebook"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Twitter" href="https://twitter.com">
                
                <i class="fab fa-twitter"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Dribbble" href="https://dribbble.com">
                
                <i class="fab fa-dribbble"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="RSS" href="/">
                
                <i class="fas fa-rss"></i>
                
            </a>
            
        </div>
        
    </div>
</div>
    
        
    
        

<div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Links
        </h3>
        <ul class="menu-list">
        
            <li>
                <a class="level is-mobile" href="https://hexo.io" target="_blank">
                    <span class="level-left">
                        <span class="level-item">Hexo</span>
                    </span>
                    <span class="level-right">
                        <span class="level-item tag">hexo.io</span>
                    </span>
                </a>
            </li>
        
            <li>
                <a class="level is-mobile" href="https://github.com/ppoffice" target="_blank">
                    <span class="level-left">
                        <span class="level-item">PPOffice</span>
                    </span>
                    <span class="level-right">
                        <span class="level-item tag">github.com</span>
                    </span>
                </a>
            </li>
        
        </ul>
        </div>
    </div>
</div>


    
        
<div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Categorias
            </h3>
            <ul class="menu-list">
            <li>
        <a class="level is-marginless" href="/categories/读书笔记/">
            <span class="level-start">
                <span class="level-item">读书笔记</span>
            </span>
            <span class="level-end">
                <span class="level-item tag">1</span>
            </span>
        </a></li>
            </ul>
        </div>
    </div>
</div>
    
        
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Nube de etiquetas
        </h3>
        <a href="/tags/HBase/" style="font-size: 10px;">HBase</a> <a href="/tags/HTTP/" style="font-size: 10px;">HTTP</a> <a href="/tags/I-O多路复用/" style="font-size: 10px;">I/O多路复用</a> <a href="/tags/JVM/" style="font-size: 10px;">JVM</a> <a href="/tags/Java/" style="font-size: 10px;">Java</a> <a href="/tags/Java并发/" style="font-size: 10px;">Java并发</a> <a href="/tags/Kafka/" style="font-size: 10px;">Kafka</a> <a href="/tags/Redis/" style="font-size: 10px;">Redis</a> <a href="/tags/Spring/" style="font-size: 10px;">Spring</a> <a href="/tags/《谷歌方法论》/" style="font-size: 15px;">《谷歌方法论》</a> <a href="/tags/网站架构/" style="font-size: 10px;">网站架构</a> <a href="/tags/网络/" style="font-size: 10px;">网络</a> <a href="/tags/论文笔记/" style="font-size: 20px;">论文笔记</a> <a href="/tags/读书笔记/" style="font-size: 20px;">读书笔记</a> <a href="/tags/锁/" style="font-size: 10px;">锁</a> <a href="/tags/面试题/" style="font-size: 10px;">面试题</a>
    </div>
</div>

    
    
        <div class="column-right-shadow is-hidden-widescreen ">
        
            
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Recientes
        </h3>
        
        <article class="media">
            
            <a href="/2019/05/24/IO多路复用总结/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="有关I/O多路复用的总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-23T16:00:00.000Z">2019-05-24</time></div>
                    <a href="/2019/05/24/IO多路复用总结/" class="has-link-black-ter is-size-6">有关I/O多路复用的总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/23/redis/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="Redis常见面试题总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-22T16:00:00.000Z">2019-05-23</time></div>
                    <a href="/2019/05/23/redis/" class="has-link-black-ter is-size-6">Redis常见面试题总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/18/HBase/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="HBase笔记总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-17T16:00:00.000Z">2019-05-18</time></div>
                    <a href="/2019/05/18/HBase/" class="has-link-black-ter is-size-6">HBase笔记总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="《大型网站技术架构》读书笔记——第1篇 概述">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-23T16:00:00.000Z">2019-03-24</time></div>
                    <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="has-link-black-ter is-size-6">《大型网站技术架构》读书笔记——第1篇 概述</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time></div>
                    <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="has-link-black-ter is-size-6">论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
    </div>
</div>

        
            <div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Archivos
        </h3>
        <ul class="menu-list">
        
        <li>
            <a class="level is-marginless" href="/archives/2019/05/">
                <span class="level-start">
                    <span class="level-item">May 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">3</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/03/">
                <span class="level-start">
                    <span class="level-item">March 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">9</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/02/">
                <span class="level-start">
                    <span class="level-item">February 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">5</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2018/10/">
                <span class="level-start">
                    <span class="level-item">October 2018</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">2</span>
                </span>
            </a>
        </li>
        
        </ul>
        </div>
    </div>
</div>
        
            <div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Etiquetas
            </h3>
            <div class="field is-grouped is-grouped-multiline">
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HBase/">
                        <span class="tag">HBase</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HTTP/">
                        <span class="tag">HTTP</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/I-O多路复用/">
                        <span class="tag">I/O多路复用</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/JVM/">
                        <span class="tag">JVM</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java/">
                        <span class="tag">Java</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java并发/">
                        <span class="tag">Java并发</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Kafka/">
                        <span class="tag">Kafka</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Redis/">
                        <span class="tag">Redis</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Spring/">
                        <span class="tag">Spring</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/《谷歌方法论》/">
                        <span class="tag">《谷歌方法论》</span>
                        <span class="tag is-grey">4</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网站架构/">
                        <span class="tag">网站架构</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网络/">
                        <span class="tag">网络</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/论文笔记/">
                        <span class="tag">论文笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/读书笔记/">
                        <span class="tag">读书笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/锁/">
                        <span class="tag">锁</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/面试题/">
                        <span class="tag">面试题</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
            </div>
        </div>
    </div>
</div>
        
        </div>
    
</div>

                




<div class="column is-4-tablet is-4-desktop is-3-widescreen is-hidden-touch is-hidden-desktop-only has-order-3 column-right ">
    
        
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Recientes
        </h3>
        
        <article class="media">
            
            <a href="/2019/05/24/IO多路复用总结/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="有关I/O多路复用的总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-23T16:00:00.000Z">2019-05-24</time></div>
                    <a href="/2019/05/24/IO多路复用总结/" class="has-link-black-ter is-size-6">有关I/O多路复用的总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/23/redis/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="Redis常见面试题总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-22T16:00:00.000Z">2019-05-23</time></div>
                    <a href="/2019/05/23/redis/" class="has-link-black-ter is-size-6">Redis常见面试题总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/18/HBase/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="HBase笔记总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-17T16:00:00.000Z">2019-05-18</time></div>
                    <a href="/2019/05/18/HBase/" class="has-link-black-ter is-size-6">HBase笔记总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="《大型网站技术架构》读书笔记——第1篇 概述">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-23T16:00:00.000Z">2019-03-24</time></div>
                    <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="has-link-black-ter is-size-6">《大型网站技术架构》读书笔记——第1篇 概述</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time></div>
                    <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="has-link-black-ter is-size-6">论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
    </div>
</div>

    
        <div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Archivos
        </h3>
        <ul class="menu-list">
        
        <li>
            <a class="level is-marginless" href="/archives/2019/05/">
                <span class="level-start">
                    <span class="level-item">May 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">3</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/03/">
                <span class="level-start">
                    <span class="level-item">March 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">9</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/02/">
                <span class="level-start">
                    <span class="level-item">February 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">5</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2018/10/">
                <span class="level-start">
                    <span class="level-item">October 2018</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">2</span>
                </span>
            </a>
        </li>
        
        </ul>
        </div>
    </div>
</div>
    
        <div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Etiquetas
            </h3>
            <div class="field is-grouped is-grouped-multiline">
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HBase/">
                        <span class="tag">HBase</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HTTP/">
                        <span class="tag">HTTP</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/I-O多路复用/">
                        <span class="tag">I/O多路复用</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/JVM/">
                        <span class="tag">JVM</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java/">
                        <span class="tag">Java</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java并发/">
                        <span class="tag">Java并发</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Kafka/">
                        <span class="tag">Kafka</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Redis/">
                        <span class="tag">Redis</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Spring/">
                        <span class="tag">Spring</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/《谷歌方法论》/">
                        <span class="tag">《谷歌方法论》</span>
                        <span class="tag is-grey">4</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网站架构/">
                        <span class="tag">网站架构</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网络/">
                        <span class="tag">网络</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/论文笔记/">
                        <span class="tag">论文笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/读书笔记/">
                        <span class="tag">读书笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/锁/">
                        <span class="tag">锁</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/面试题/">
                        <span class="tag">面试题</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
            </div>
        </div>
    </div>
</div>
    
    
</div>

            </div>
        </div>
    </section>
    <footer class="footer">
    <div class="container">
        <div class="level">
            <div class="level-start has-text-centered-mobile">
                <a class="footer-logo is-block has-mb-6" href="/">
                
                    <img src="/images/logo.svg" alt="Ivan的记录" height="28">
                
                </a>
                <p class="is-size-7">
                &copy; 2019 Ivan Lu&nbsp;
                Powered by <a href="https://hexo.io/" target="_blank">Hexo</a> & <a
                        href="https://github.com/ppoffice/hexo-theme-icarus" target="_blank">Icarus</a>
                
                </p>
            </div>
            <div class="level-end">
            
                <div class="field has-addons is-flex-center-mobile has-mt-5-mobile is-flex-wrap is-flex-middle">
                
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Creative Commons" href="https://creativecommons.org/">
                        
                        <i class="fab fa-creative-commons"></i>
                        
                    </a>
                </p>
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Attribution 4.0 International" href="https://creativecommons.org/licenses/by/4.0/">
                        
                        <i class="fab fa-creative-commons-by"></i>
                        
                    </a>
                </p>
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Download on GitHub" href="https://github.com/ppoffice/hexo-theme-icarus">
                        
                        <i class="fab fa-github"></i>
                        
                    </a>
                </p>
                
                </div>
            
            </div>
        </div>
    </div>
</footer>
    <script src="https://cdn.jsdelivr.net/npm/jquery@3.3.1/dist/jquery.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/moment@2.22.2/min/moment-with-locales.min.js"></script>
<script>moment.locale("zh-Hans");</script>


    
    
    
    <script src="/js/animation.js"></script>
    

    
    
    
    <script src="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/js/lightgallery.min.js" defer></script>
    <script src="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/js/jquery.justifiedGallery.min.js" defer></script>
    <script src="/js/gallery.js" defer></script>
    

    
    

<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update
            my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="https://cdn.jsdelivr.net/npm/outdatedbrowser@1.1.5/outdatedbrowser/outdatedbrowser.min.js" defer></script>
<script>
    document.addEventListener("DOMContentLoaded", function () {
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        });
    });
</script>


    
    
<script src="https://cdn.jsdelivr.net/npm/mathjax@2.7.5/unpacked/MathJax.js?config=TeX-MML-AM_CHTML" defer></script>
<script>
document.addEventListener('DOMContentLoaded', function () {
    MathJax.Hub.Config({
        'HTML-CSS': {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
});
</script>

    
    

<a id="back-to-top" title="Kembali ke atas" href="javascript:;">
    <i class="fas fa-chevron-up"></i>
</a>
<script src="/js/back-to-top.js" defer></script>


    
    

    
    
    
    

    
    
    
    
    
    <script src="https://cdn.jsdelivr.net/npm/clipboard@2.0.4/dist/clipboard.min.js" defer></script>
    <script src="/js/clipboard.js" defer></script>
    

    
    
    


<script src="/js/main.js" defer></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Entradas',
                PAGES: 'Pages',
                CATEGORIES: 'Categorias',
                TAGS: 'Etiquetas',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js" defer></script>
<link rel="stylesheet" href="/css/search.css">
<link rel="stylesheet" href="/css/insight.css">
    
</body>
</html>