<!DOCTYPE html>
<html  lang="zh">
<head>
    <meta charset="utf-8">
<title>Ivan的记录</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1" />



    <meta name="description" content="这是我学习过程的记录">
<meta name="keywords" content="博客，Java，Geek">
<meta property="og:type" content="website">
<meta property="og:title" content="Ivan的记录">
<meta property="og:url" content="https://ivanlu1024.github.io/page/6/index.html">
<meta property="og:site_name" content="Ivan的记录">
<meta property="og:description" content="这是我学习过程的记录">
<meta property="og:locale" content="zh-Hans">
<meta property="og:image" content="https://ivanlu1024.github.io/images/og_image.png">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Ivan的记录">
<meta name="twitter:description" content="这是我学习过程的记录">
<meta name="twitter:image" content="https://ivanlu1024.github.io/images/og_image.png">







<link rel="icon" href="/images/favicon.svg">


<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bulma@0.7.2/css/bulma.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.4.1/css/all.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Ubuntu:400,600|Source+Code+Pro">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/highlight.js@9.12.0/styles/atom-one-light.css">


    
    
    
    <style>body>.footer,body>.navbar,body>.section{opacity:0}</style>
    

    
    
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/css/lightgallery.min.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/css/justifiedGallery.min.css">
    

    
    

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/outdatedbrowser@1.1.5/outdatedbrowser/outdatedbrowser.min.css">


    
    
    
    

<link rel="stylesheet" href="/css/back-to-top.css">


    
    

    
    
    
    

    
    
<link rel="stylesheet" href="/css/progressbar.css">
<script src="https://cdn.jsdelivr.net/npm/pace-js@1.0.2/pace.min.js"></script>

    
    
    

    
    
    


<link rel="stylesheet" href="/css/style.css">
</head>
<body class="is-3-column">
    <nav class="navbar navbar-main">
    <div class="container">
        <div class="navbar-brand is-flex-center">
            <a class="navbar-item navbar-logo" href="/">
            
                <img src="/images/logo.svg" alt="Ivan的记录" height="28">
            
            </a>
        </div>
        <div class="navbar-menu">
            
            <div class="navbar-start">
                
                <a class="navbar-item"
                href="/">Home</a>
                
                <a class="navbar-item"
                href="/archives">Archives</a>
                
                <a class="navbar-item"
                href="/categories">Categories</a>
                
                <a class="navbar-item"
                href="/tags">Tags</a>
                
                <a class="navbar-item"
                href="/about">About</a>
                
            </div>
            
            <div class="navbar-end">
                
                    
                    
                    <a class="navbar-item" target="_blank" title="Download on GitHub" href="https://github.com/ppoffice/hexo-theme-icarus">
                        
                        <i class="fab fa-github"></i>
                        
                    </a>
                    
                
                
                
                <a class="navbar-item search" title="Search" href="javascript:;">
                    <i class="fas fa-search"></i>
                </a>
                
            </div>
        </div>
    </div>
</nav>
    
    <section class="section">
        <div class="container">
            <div class="columns">
                <div class="column is-8-tablet is-8-desktop is-6-widescreen has-order-2 column-main">
    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-02-18T07:04:49.017Z">2019-02-18</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    5 minutes read (About 773 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/02/18/000思维方式决定商业模式/">000思维方式决定商业模式</a>
            
        </h1>
        <div class="content">
            <h1 id="&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x51B3;&#x5B9A;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;"><a href="#&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x51B3;&#x5B9A;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;" class="headerlink" title="&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x51B3;&#x5B9A;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;"></a>&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x51B3;&#x5B9A;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;</h1><p>&#x751F;&#x6D3B;&#x5728;&#x5C0F;&#x6570;&#x5B57;&#x4E16;&#x754C;&#x7684;&#x4EBA;&#xFF0C;&#x5929;&#x7136;&#x5730;&#x7F3A;&#x4E4F;&#x5904;&#x7406;&#x5927;&#x6570;&#x5B57;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x95EE;&#x9898;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x65E0;&#x5F62;&#x4E4B;&#x4E2D;&#x5730;&#x5C06;&#x4EBA;&#x4EEC;&#x9650;&#x5236;&#x5728;&#x5929;&#x82B1;&#x677F;&#x4E4B;&#x4E0B;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x4E00;&#x662F;&#x8D85;&#x8FC7;&#x4E00;&#x767E;&#x53CC;&#x978B;&#x5B50;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x7C7B;&#x7BA1;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x978B;&#x5B50;&#x518D;&#x591A;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x5206;&#x7C7B;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x978B;&#x5B50;&#x5EFA;&#x7D22;&#x5F15;&#xFF1B;&#x4E8C;&#x662F;&#x8FD1;&#x4E07;&#x518C;&#x85CF;&#x4E66;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5BF9;&#x4E66;&#x7C4D;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x627E;&#x4E00;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x8981;&#x4ECE;&#x7D22;&#x5F15;&#x4E2D;&#x627E;&#x5230;&#x90A3;&#x672C;&#x4E66;&#x5728;&#x7B2C;&#x51E0;&#x6392;&#x4E66;&#x67B6;&#xFF0C;&#x7B2C;&#x51E0;&#x4E2A;&#x67B6;&#x5B50;&#xFF0C;&#x7B2C;&#x51E0;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5230;&#x90A3;&#x4E00;&#x6392;&#x53BB;&#x627E;&#x4E66;&#x3002;</p>
<p>&#x4EBA;&#x751F;&#x6D3B;&#x5728;&#x5C0F;&#x6570;&#x5B57;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x96BE;&#x514D;&#x4FDD;&#x7559;&#x56FA;&#x6709;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x4F46;&#x662F;&#x65E2;&#x7136;&#x4ECE;&#x4E8B;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6309;&#x7167;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x89C4;&#x77E9;&#x6765;&#x529E;&#x4E8B;&#xFF0C;<strong>&#x4E0D;&#x80FD;&#x5148;&#x9A8C;&#x5730;&#x5047;&#x8BBE;&#x6570;&#x503C;&#x4E00;&#x5B9A;&#x4E0D;&#x591A;&#x3002;</strong></p>
<p>&#x5176;&#x6B21;&#xFF0C;<strong>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4F18;&#x5316;&#x8FC7;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x4F5C;&#x4E3A;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x64C5;&#x957F;&#x4F7F;&#x7528;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x7ED9;&#x51FA;&#x7684;&#xFF0C;&#x9A8C;&#x8BC1;&#x4E86;&#x65E0;&#x6570;&#x6B21;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x51ED;&#x7740;&#x751F;&#x6D3B;&#x7ECF;&#x9A8C;&#x4E00;&#x62CD;&#x8111;&#x888B;&#x5730;&#x60F3;&#x51FA;&#x4E00;&#x4E2A;&#x505A;&#x6CD5;&#x3002;</strong>&#x5982;&#x679C;&#x4E3A;&#x4E86;&#x8D76;&#x65F6;&#x95F4;&#xFF0C;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x73B0;&#x6709;&#x7684;&#xFF0C;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;IT&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x9047;&#x5230;&#x804C;&#x4E1A;&#x5929;&#x82B1;&#x677F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;<strong>&#x4E00;&#x5F00;&#x59CB;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x5C31;&#x9519;&#x4E86;&#x3002;</strong>&#x4E0D;&#x514B;&#x670D;&#x6211;&#x4EEC;&#x5148;&#x5929;&#x8BA4;&#x8BC6;&#x4E0A;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x9886;&#x4F1A;IT&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x7CBE;&#x9AD3;&#xFF0C;&#x5F53;&#x7136;&#x4E8B;&#x4E1A;&#x4E5F;&#x5C31;&#x505A;&#x4E0D;&#x4E0A;&#x53BB;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x9053;&#x7406;&#x540C;&#x6837;&#x9002;&#x5E94;&#x4E8E;&#x4F01;&#x4E1A;&#xFF0C;&#x4F8B;&#x5982;&#x66FE;&#x7ECF;&#x8F89;&#x714C;&#x8FC7;&#x7684;&#x96C5;&#x864E;&#x516C;&#x53F8;&#x548C;&#x4E2D;&#x56FD;&#x51E0;&#x5927;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#x4ECA;&#x5929;&#x9047;&#x5230;&#x7684;&#x56F0;&#x5883;&#xFF0C;&#x5C31;&#x690D;&#x6839;&#x4E8E;&#x6B64;&#x3002;</p>
<p>&#x5728;&#x4E92;&#x8054;&#x7F51;2.0&#x65F6;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x65B0;&#x95FB;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x65B0;&#x95FB;&#x591A;&#x5F97;&#x9760;&#x680F;&#x76EE;&#x5206;&#x7C7B;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x4E0D;&#x5F97;&#x4E0D;&#x9760;&#x4E2A;&#x6027;&#x5316;&#x7B5B;&#x9009;&#x65B0;&#x95FB;&#x3002;<strong>&#x65B0;&#x95FB;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#x7684;&#x6BCF;&#x51B5;&#x6108;&#x4E0B;&#x548C;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E24;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x5BF9;&#x51B3;&#x3002;</strong></p>
<p>&#x53EF;&#x4EE5;&#x8BB2;&#xFF0C;<strong>&#x5BF9;&#x6570;&#x91CF;&#x5927;&#x5C0F;&#x7684;&#x8BA4;&#x77E5;&#x51B3;&#x5B9A;&#x4E86;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x51B3;&#x5B9A;&#x4E86;&#x4F01;&#x4E1A;&#x7684;&#x6210;&#x8D25;&#x3002;</strong>&#x5728;&#x65B0;&#x65F6;&#x4EE3;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x548C;&#x6709;&#x76CA;&#x7684;&#x6050;&#x6015;&#x662F;&#x5728;&#x601D;&#x7EF4;&#x4E0A;&#x8981;&#x63D0;&#x5347;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x5BB9;&#x6613;&#x6210;&#x4E3A;&#x65B0;&#x65F6;&#x4EE3;&#x524D;2%&#x7684;&#x53D7;&#x76CA;&#x8005;&#x3002;</p>
<h2 id="&#x91CD;&#x70B9;&#x603B;&#x7ED3;"><a href="#&#x91CD;&#x70B9;&#x603B;&#x7ED3;" class="headerlink" title="&#x91CD;&#x70B9;&#x603B;&#x7ED3;"></a>&#x91CD;&#x70B9;&#x603B;&#x7ED3;</h2><p>&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x5728;&#x5C0F;&#x6570;&#x5B57;&#x4E16;&#x754C;&#xFF0C;&#x4ECE;&#x5C0F;&#x6570;&#x5B57;&#x4E16;&#x754C;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x65E0;&#x6CD5;&#x5E94;&#x7528;&#x5230;&#x66F4;&#x9AD8;&#x91CF;&#x7EA7;&#x7684;&#x5927;&#x6570;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#xFF0C;&#x63D0;&#x524D;&#x628A;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x5728;&#x5927;&#x6570;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x624D;&#x80FD;&#x5EFA;&#x7ACB;&#x66F4;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E2A;&#x4EBA;&#xFF0C;&#x5FC5;&#x987B;&#x5347;&#x7EA7;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x624D;&#x80FD;&#x9002;&#x5E94;&#x589E;&#x957F;&#x8FC5;&#x901F;&#x7684;&#x5927;&#x6570;&#x4E16;&#x754C;&#xFF0C;&#x6210;&#x4E3A;&#x65B0;&#x65F6;&#x4EE3;&#x524D;2%&#x7684;&#x53D7;&#x76CA;&#x8005;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2019-02-18T07:04:49.014Z">2019-02-18</time>
                
                <div class="level-item">
                <a class="has-link-grey -link" href="/categories/读书笔记/">读书笔记</a>
                </div>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    5 minutes read (About 759 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2019/02/18/002工程思维：直觉和极限/">002工程思维：直觉和极限</a>
            
        </h1>
        <div class="content">
            <h1 id="&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#xFF1A;&#x76F4;&#x89C9;&#x548C;&#x6781;&#x9650;"><a href="#&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#xFF1A;&#x76F4;&#x89C9;&#x548C;&#x6781;&#x9650;" class="headerlink" title="&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#xFF1A;&#x76F4;&#x89C9;&#x548C;&#x6781;&#x9650;"></a>&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#xFF1A;&#x76F4;&#x89C9;&#x548C;&#x6781;&#x9650;</h1><p><strong>&#x7ED3;&#x5408;&#x751F;&#x6D3B;&#x73AF;&#x5883;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x89C9;&#x662F;&#x5982;&#x4F55;&#x8BEF;&#x5BFC;&#x6211;&#x4EEC;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x5DE5;&#x7A0B;&#x4E2D;&#x201C;&#x6781;&#x9650;&#x201D;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5982;&#x4F55;&#x8BA9;&#x6211;&#x4EEC;&#x7A81;&#x7834;&#x8BA4;&#x8BC6;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6BD4;&#x5E38;&#x4EBA;&#x66F4;&#x5FEB;&#x5730;&#x770B;&#x6E05;&#x695A;&#x95EE;&#x9898;&#x7684;&#x672C;&#x8D28;&#x3002;</strong></p>
<p>&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x76F4;&#x89C9;&#x548C;&#x751F;&#x6D3B;&#x5E38;&#x8BC6;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x7F3A;&#x4E4F;&#x77E5;&#x8BC6;&#x7684;&#x76F4;&#x89C9;&#x4F1A;&#x6B3A;&#x9A97;&#x6211;&#x4EEC;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x5206;&#x82F9;&#x679C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x522E;&#x6389;&#x91CC;&#x9762;&#x76F4;&#x5F84;&#x7684;70%&#x7684;&#x90E8;&#x5206;&#x662F;&#x5C0F;&#x4E8E;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x3002;&#x6839;&#x636E;&#x4F53;&#x79EF;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x53EA;&#x6709;&#x522E;&#x6389;&#x82F9;&#x679C;&#x91CC;&#x9762;&#x76F4;&#x5F84;&#x7684;80%&#xFF0C;&#x91CC;&#x5916;&#x7684;&#x91CD;&#x91CF;&#x624D;&#x5927;&#x81F4;&#x76F8;&#x5F53;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7403;&#x7684;&#x76F4;&#x5F84;&#x589E;&#x5927;&#x4E00;&#x500D;&#xFF0C;&#x4F53;&#x79EF;&#x53EF;&#x662F;&#x5927;7&#x500D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x4E24;&#x4E09;&#x500D;&#x3002;</p>
<p>&#x53C8;&#x5982;&#xFF1A;Google&#x8FC7;&#x53BB;&#x9762;&#x8BD5;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x9053;&#x9762;&#x8BD5;&#x9898;&#x2014;&#x2014;&#x9762;&#x8BD5;&#x7684;&#x623F;&#x95F4;&#x91CC;&#x80FD;&#x591F;&#x88C5;&#x4E0B;&#x591A;&#x5C11;&#x4E2A;&#x9AD8;&#x5C14;&#x592B;&#x7403;&#xFF1F;</p>
<p>&#x80E1;&#x731C;&#x5BF9;&#x4E8E;&#x8FD9;&#x9053;&#x9898;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF01;&#x7B80;&#x5355;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#xFF0C;&#x9AD8;&#x5C14;&#x592B;&#x7403;&#x5927;&#x7EA6;&#x76F4;&#x5F84;4&#x5398;&#x7C73;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x6574;&#x6574;&#x9F50;&#x9F50;&#x5730;&#x50CF;&#x7ACB;&#x65B9;&#x4F53;&#x90A3;&#x6837;&#x7801;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7528;&#x773C;&#x775B;&#x4F30;&#x6478;&#x7740;&#x623F;&#x95F4;&#x7684;&#x9762;&#x79EF;&#x548C;&#x9AD8;&#x5EA6;&#xFF0C;&#x7528;&#x5C0F;&#x5B66;&#x6570;&#x5B66;&#x5C31;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x3002;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x9762;&#x79EF;15&#x5E73;&#x65B9;&#xFF0C;&#x9AD8;3&#x7C73;&#x7684;&#x5C0F;&#x4F1A;&#x8BAE;&#x5BA4;&#xFF0C;&#x5927;&#x7EA6;&#x53EF;&#x4EE5;&#x88C5;70&#x4E07;&#x4E2A;&#xFF08;10,000*70&#xFF09;&#x3002;<strong>Google&#x8003;&#x5BDF;&#x8FD9;&#x4E00;&#x9898;&#x7684;&#x76EE;&#x7684;&#x662F;&#xFF1A;&#x8981;&#x6C42;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5728;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x7ED9;&#x51FA;&#x7ED3;&#x8BBA;&#x3002;</strong>&#x9075;&#x5FAA;&#x4E00;&#x5957;&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4F30;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x5927;&#x81F4;&#x6570;&#x91CF;&#x7EA7;&#x4E0D;&#x5927;&#x4F1A;&#x51FA;&#x9519;&#x3002;</p>
<p><strong>&#x5728;&#x4E0A;&#x9762;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x66F4;&#x6B63;&#x9519;&#x8BEF;&#x7684;&#x76F4;&#x89C9;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0A;&#x8981;&#x6211;&#x4EEC;&#x653E;&#x5F03;&#x6389;&#x6211;&#x4EEC;&#x4ECE;&#x751F;&#x6D3B;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x76F4;&#x89C9;&#xFF0C;&#x5219;&#x662F;&#x5343;&#x96BE;&#x4E07;&#x96BE;&#x3002;</strong></p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x9AD8;&#x901F;&#x884C;&#x8FDB;&#x7684;&#x706B;&#x8F66;&#x4E0A;&#x5206;&#x522B;&#x5F80;&#x524D;&#x9762;&#x548C;&#x540E;&#x9762;&#x5404;&#x6253;&#x4E00;&#x675F;&#x5149;&#xFF0C;&#x54EA;&#x675F;&#x5149;&#x7684;&#x901F;&#x5EA6;&#x5FEB;&#xFF1F;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x89C9;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4F4E;&#x4FD7;&#x4E16;&#x754C;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x5F80;&#x524D;&#x6253;&#x7684;&#x5149;&#x66F4;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x901F;&#x5EA6;&#x662F;&#x53E0;&#x52A0;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x7684;&#x76F8;&#x5BF9;&#x8BBA;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x4E00;&#x6837;&#x5FEB;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5149;&#x901F;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#xFF0C;&#x4EA7;&#x751F;&#x4E0D;&#x4E86;&#x53E0;&#x52A0;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p><strong>&#x6781;&#x9650;&#x5BF9;&#x4E8E;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BB2;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x3002;</strong>&#x4EFB;&#x4F55;&#x4EA7;&#x54C1;&#x7684;&#x6027;&#x80FD;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x4E0A;&#x65E0;&#x6CD5;&#x7A81;&#x7834;&#x7684;&#x6781;&#x9650;&#xFF0C;&#x8FD9;&#x4E2A;&#x6781;&#x9650;&#x65E9;&#x5C31;&#x901A;&#x8FC7;&#x5DF2;&#x6709;&#x7684;&#x7406;&#x8BBA;&#x76F4;&#x63A5;&#x7ED9;&#x51FA;&#x3002;</p>
<h2 id="&#x91CD;&#x70B9;&#x603B;&#x7ED3;"><a href="#&#x91CD;&#x70B9;&#x603B;&#x7ED3;" class="headerlink" title="&#x91CD;&#x70B9;&#x603B;&#x7ED3;"></a>&#x91CD;&#x70B9;&#x603B;&#x7ED3;</h2><p>&#x76F4;&#x89C9;&#x5F88;&#x5BB9;&#x6613;&#x8BEF;&#x5BFC;&#x4EBA;&#xFF0C;&#x638C;&#x63E1;&#x5DE5;&#x7A0B;&#x4E2D;&#x7684;&#x201C;&#x6781;&#x9650;&#x201D;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7A81;&#x7834;&#x8BA4;&#x8BC6;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6BD4;&#x5E38;&#x4EBA;&#x66F4;&#x5FEB;&#x5730;&#x770B;&#x6E05;&#x695A;&#x95EE;&#x9898;&#x7684;&#x672C;&#x8D28;&#x3002;</p>
<p><strong>&#x6240;&#x8C13;&#x638C;&#x63E1;&#x5DE5;&#x7A0B;&#x601D;&#x7EF4;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x6BD4;&#x751F;&#x6D3B;&#x8D85;&#x8D8A;&#x4E00;&#x4E2A;&#x5C42;&#x7EA7;&#x3002;</strong>&#x8FD9;&#x5C31;&#x5982;&#x540C;&#x4F60;&#x770B;&#x8682;&#x8681;&#x7684;&#x722C;&#x884C;&#x8F68;&#x8FF9;&#x65F6;&#xFF0C;&#x4E0D;&#x80FD;&#x8DDF;&#x5728;&#x5B83;&#x7684;&#x540E;&#x9762;&#xFF0C;&#x800C;&#x8981;&#x4ECE;&#x5B83;&#x7684;&#x4E0A;&#x65B9;&#x770B;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>








    <div class="card">
    
    <div class="card-content article ">
        
        <div class="level article-meta is-size-7 is-uppercase is-mobile is-overflow-x-auto">
            <div class="level-left">
                <time class="level-item has-text-grey" datetime="2018-10-24T13:08:37.000Z">2018-10-24</time>
                
                
                <span class="level-item has-text-grey">
                    
                    
                    33 minutes read (About 4884 words)
                </span>
                
                
            </div>
        </div>
        
        <h1 class="title is-size-3 is-size-4-mobile has-text-weight-normal">
            
                <a class="has-link-black-ter" href="/2018/10/24/Spring的阅读笔记/">Spring的阅读笔记</a>
            
        </h1>
        <div class="content">
            <h1 id="Spring&#x7684;&#x9605;&#x8BFB;&#x7B14;&#x8BB0;"><a href="#Spring&#x7684;&#x9605;&#x8BFB;&#x7B14;&#x8BB0;" class="headerlink" title="Spring&#x7684;&#x9605;&#x8BFB;&#x7B14;&#x8BB0;"></a>Spring&#x7684;&#x9605;&#x8BFB;&#x7B14;&#x8BB0;</h1><hr>
<h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><hr>
<blockquote>
<p>&#x5728;&#x9605;&#x8BFB; Spring<br>&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF08;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x90E8;&#x5206;&#x548C;&#x9762;&#x5411;&#x5207;&#x9762;&#x7F16;&#x7A0B;&#x90E8;&#x5206;&#xFF09;&#x65F6;&#x9047;&#x5230;&#x4E0D;&#x5C11;&#x56F0;&#x60D1;&#xFF0C;&#x5E9E;&#x5927;&#x7684;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x3001;&#x7EB7;&#x7E41;&#x590D;&#x6742;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3001;&#x6CE2;&#x8BE1;&#x4E91;&#x8C32;&#x7684;&#x591A;&#x6001;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x6DF1;&#x9677;&#x5176;&#x4E2D;&#x3001;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#x3002;<br>&#x540E;&#x6765;&#x6CE8;&#x610F;&#x5230; code4craft &#x7684; tiny-spring &#x9879;&#x76EE;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5FAE;&#x578B;&#x7684; Spring&#xFF0C;&#x63D0;&#x4F9B;&#x5BF9; IoC &#x548C; AOP<br>&#x7684;&#x6700;&#x57FA;&#x672C;&#x652F;&#x6301;&#xFF0C;&#x9EBB;&#x96C0;&#x867D;&#x5C0F;&#xFF0C;&#x4E94;&#x810F;&#x4FF1;&#x5168;&#xFF0C;&#x5BF9; Spring &#x7684;&#x8BA4;&#x77E5;&#x6E05;&#x6670;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x8FD9;&#x4E2A;&#x5FAE;&#x578B;&#x6846;&#x67B6;&#x7684;&#x7ED3;&#x6784;&#x5305;&#x62EC;&#x6587;&#x4EF6;&#x540D;&#x3001;&#x65B9;&#x6CD5;&#x540D;&#x90FD;&#x662F;&#x53C2;&#x7167; Spring<br>&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x521D;&#x8BFB; Spring &#x7684;&#x5B66;&#x4E60;&#x8005;&#xFF0C;&#x4F5C;&#x4E3A;&#x7814;&#x7A76; Spring &#x7684;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x3002;  &#x5728;&#x7814;&#x7A76; tiny-spring<br>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6536;&#x83B7;&#x9887;&#x591A;&#xFF0C;&#x628A;&#x5BF9;&#x8FD9;&#x4E2A;&#x5FAE;&#x578B;&#x6846;&#x67B6;&#x7684;&#x4E00;&#x4E9B;&#x5206;&#x6790;&#x5199;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x884C;&#x6587;&#x53EF;&#x80FD;&#x6709;&#x70B9;&#x7D0A;&#x4E71;&#x3002;</p>
</blockquote>
<hr>
<h2 id="&#x672C;&#x6587;&#x7ED3;&#x6784;"><a href="#&#x672C;&#x6587;&#x7ED3;&#x6784;" class="headerlink" title="&#x672C;&#x6587;&#x7ED3;&#x6784;"></a>&#x672C;&#x6587;&#x7ED3;&#x6784;</h2><blockquote>
<p>&#x7B2C;&#x4E00;&#x90E8;&#x5206; IoC &#x5BB9;&#x5668;&#x7684;&#x5B9E;&#x73B0; &#x5BF9;&#x5E94;&#x4E86; tiny-spring &#x7684; step-1 &#x5230; step-5 &#x90E8;&#x5206;&#xFF0C;&#x8FD9; 5 &#x4E2A; step &#x5B9E;&#x73B0;&#x4E86;&#x57FA;&#x672C;&#x7684;</p>
</blockquote>
<blockquote>
<p>IoC &#x5BB9;&#x5668;&#xFF0C;&#x652F;&#x6301;singleton&#x7C7B;&#x578B;&#x7684;bean&#xFF0C;&#x5305;&#x62EC;&#x521D;&#x59CB;&#x5316;&#x3001;&#x5C5E;&#x6027;&#x6CE8;&#x5165;&#x3001;&#x4EE5;&#x53CA;&#x4F9D;&#x8D56; Bean &#x6CE8;&#x5165;&#xFF0C;&#x53EF;&#x4ECE; XML &#x4E2D;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#xFF0C;XML</p>
</blockquote>
<blockquote>
<p>&#x8BFB;&#x53D6;&#x65B9;&#x5F0F;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x6DF1;&#x5165;&#x3002; &#x7B2C;&#x4E8C;&#x90E8;&#x5206; AOP &#x5BB9;&#x5668;&#x7684;&#x5B9E;&#x73B0; &#x5BF9;&#x5E94;&#x4E86; tiny-spring &#x7684; step-6 &#x5230; step-9</p>
</blockquote>
<blockquote>
<p>&#x90E8;&#x5206;&#x3002;step-10 &#x4E2D;&#x5BF9; cglib &#x7684;&#x652F;&#x6301;&#x6CA1;&#x6709;&#x5206;&#x6790;&#x3002;&#x8FD9; 4 &#x4E2A; step &#x53EF;&#x4EE5;&#x4F7F;&#x7528; AspectJ &#x7684;&#x8BED;&#x6CD5;&#x8FDB;&#x884C; AOP<br>&#x7F16;&#x5199;&#xFF0C;&#x652F;&#x6301;&#x63A5;&#x53E3;&#x4EE3;&#x7406;&#x3002;&#x8003;&#x8651;&#x5230; AspectJ &#x8BED;&#x6CD5;&#x4EC5;&#x7528;&#x4E8E;&#x5B9E;&#x73B0; execution(&#x201C;***&#x201D;) &#x90E8;&#x5206;&#x7684;&#x89E3;&#x6790;&#xFF0C;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Java<br>&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7C97;&#x7565;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x5173;&#x6CE8;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x3002;<br>&#x53C2;&#x8003;&#x4E66;&#x76EE;  &#x300A;Spring &#x5B9E;&#x6218;&#x300B;&#x300A;Spring &#x6280;&#x672F;&#x5185;&#x5E55;&#x300B;</p>
</blockquote>
<p>tiny-spring &#x5206;&#x6790;<br>IoC &#x5BB9;&#x5668;&#x7684;&#x5B9E;&#x73B0;<br>&#x6587;&#x4EF6;&#x7ED3;&#x6784;<br>Resource<br>BeanDefinition<br>BeanFactory<br>ApplicationContext<br>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;<br>&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;<br>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;<br>AOP &#x7684;&#x5B9E;&#x73B0;<br>&#x91CD;&#x65B0;&#x5206;&#x6790; IoC &#x5BB9;&#x5668;<br>BeanFactory &#x7684;&#x6784;&#x9020;&#x4E0E;&#x6267;&#x884C;<br>ApplicationContext &#x7684;&#x6784;&#x9020;&#x548C;&#x6267;&#x884C;<br>IoC &#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x4E0E;&#x5206;&#x6790;<br>&#x5206;&#x6790; 1&#xFF1A;AOP &#x53EF;&#x4EE5;&#x5728;&#x4F55;&#x5904;&#x88AB;&#x5D4C;&#x5165;&#x5230; IoC &#x5BB9;&#x5668;&#x4E2D;&#x53BB;&#xFF1F;<br>&#x5206;&#x6790; 2&#xFF1A;BeanFactory &#x548C; ApplicationContext &#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x8026;&#x5408;<br>&#x5206;&#x6790; 3&#xFF1A;tiny-spring &#x603B;&#x4F53;&#x6D41;&#x7A0B;&#x7684;&#x5206;&#x6790;<br>JDK &#x5BF9;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x652F;&#x6301;<br>AOP &#x7684;&#x690D;&#x5165;&#x4E0E;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;<br>&#x5728; Bean &#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B8C;&#x6210; AOP &#x7684;&#x690D;&#x5165;<br>AOP &#x4E2D;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;<br>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5185;&#x5BB9;<br>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x6B65;&#x9AA4;<br>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;<br>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;<br>&#x7B56;&#x7565;&#x6A21;&#x5F0F;<br>&#x4E3A; tiny-spring &#x6DFB;&#x52A0;&#x62E6;&#x622A;&#x5668;&#x94FE;<br>&#x4E3A;&#x4EC0;&#x4E48; GitHub &#x4E0D;&#x652F;&#x6301; TOC</p>
<p>IoC &#x5BB9;&#x5668;&#x7684;&#x5B9E;&#x73B0;<br>&#x6587;&#x4EF6;&#x7ED3;&#x6784;<br>Resource<br>&#x4EE5; Resource &#x63A5;&#x53E3;&#x4E3A;&#x6838;&#x5FC3;&#x53D1;&#x6563;&#x51FA;&#x7684;&#x51E0;&#x4E2A;&#x7C7B;&#xFF0C;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x89E3;&#x51B3; IoC &#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; &#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4ECE;&#x54EA;&#x91CC;&#x8BFB;&#x53D6;&#x3001;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5982;&#x4F55;&#x8BFB;&#x53D6; &#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>Resource    &#x63A5;&#x53E3;&#xFF0C;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x8D44;&#x6E90;&#x3002;&#x901A;&#x8FC7; getInputStream() &#x65B9;&#x6CD5; &#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x7684;&#x8F93;&#x5165;&#x6D41; &#x3002;<br>UrlResource    &#x5B9E;&#x73B0; Resource &#x63A5;&#x53E3;&#x7684;&#x8D44;&#x6E90;&#x7C7B;&#xFF0C;&#x901A;&#x8FC7; URL &#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x3002;<br>ResourceLoader    &#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x7C7B;&#x3002;&#x901A;&#x8FC7; getResource(String) &#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A; Resouce &#x5BF9;&#x8C61;&#xFF0C;&#x662F; &#x83B7;&#x53D6; Resouce &#x7684;&#x4E3B;&#x8981;&#x9014;&#x5F84; &#x3002;<br>&#x6CE8;&#xFF1A; &#x8FD9;&#x91CC;&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#xFF0C;ResourceLoader &#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A; UrlResource&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x58F0;&#x660E;&#x4E00;&#x4E2A; ResourceLoader &#x63A5;&#x53E3;&#xFF0C;&#x518D;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A; UrlResourceLoader &#x7C7B;&#x7528;&#x4E8E;&#x52A0;&#x8F7D; UrlResource&#x3002;</p>
<p>BeanDefinition<br>&#x4EE5; BeanDefinition &#x7C7B;&#x4E3A;&#x6838;&#x5FC3;&#x53D1;&#x6563;&#x51FA;&#x7684;&#x51E0;&#x4E2A;&#x7C7B;&#xFF0C;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x89E3;&#x51B3; Bean &#x7684;&#x5177;&#x4F53;&#x5B9A;&#x4E49;&#x95EE;&#x9898;&#xFF0C;&#x5305;&#x62EC; Bean &#x7684;&#x540D;&#x5B57;&#x662F;&#x4EC0;&#x4E48;&#x3001;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x8D4B;&#x4E88;&#x4E86;&#x54EA;&#x4E9B;&#x503C;&#x6216;&#x8005;&#x5F15;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; &#x5982;&#x4F55;&#x5728; IoC &#x5BB9;&#x5668;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A; Bean&#xFF0C;&#x4F7F;&#x5F97; IoC &#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x6765;&#x751F;&#x6210;&#x5B9E;&#x4F8B; &#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>BeanDefinition    &#x8BE5;&#x7C7B;&#x4FDD;&#x5B58;&#x4E86; Bean &#x5B9A;&#x4E49;&#x3002;&#x5305;&#x62EC; Bean &#x7684; &#x540D;&#x5B57; String beanClassName&#x3001;&#x7C7B;&#x578B; Class beanClass&#x3001;&#x5C5E;&#x6027; PropertyValues propertyValues&#x3002;&#x6839;&#x636E;&#x5176; &#x7C7B;&#x578B; &#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7C7B;&#x5B9E;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x628A; &#x5C5E;&#x6027; &#x6CE8;&#x5165;&#x8FDB;&#x53BB;&#x3002;propertyValues &#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x4E2A; PropertyValue &#x6761;&#x76EE;&#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x90FD;&#x662F;&#x952E;&#x503C;&#x5BF9; String - Object&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x8981;&#x751F;&#x6210;&#x5B9E;&#x4F8B;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x540D;&#x5B57;&#x4E0E;&#x7C7B;&#x578B;&#x3002;&#x5728; Spring &#x7684; XML &#x4E2D;&#x7684; property &#x4E2D;&#xFF0C;&#x952E;&#x662F; key &#xFF0C;&#x503C;&#x662F; value &#x6216;&#x8005; ref&#x3002;&#x5BF9;&#x4E8E; value &#x53EA;&#x8981;&#x76F4;&#x63A5;&#x6CE8;&#x5165;&#x5C5E;&#x6027;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4F46;&#x662F; ref &#x8981;&#x5148;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;Object &#x5982;&#x679C;&#x662F; BeanReference &#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x5176;&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#xFF0C;&#x5176;&#x4E2D;&#x4FDD;&#x5B58;&#x4E86;&#x5F15;&#x7528;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5148;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x8F6C;&#x5316;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x9645; Object&#x3002;<br>BeanDefinitionReader    &#x89E3;&#x6790; BeanDefinition &#x7684;&#x63A5;&#x53E3;&#x3002;&#x901A;&#x8FC7; loadBeanDefinitions(String) &#x6765;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49;&#x3002;<br>AbstractBeanDefinitionReader    &#x5B9E;&#x73B0; BeanDefinitionReader &#x63A5;&#x53E3;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#xFF08;&#x672A;&#x5177;&#x4F53;&#x5B9E;&#x73B0; loadBeanDefinitions&#xFF0C;&#x800C;&#x662F;&#x89C4;&#x8303;&#x4E86; BeanDefinitionReader &#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF09;&#x3002;&#x5185;&#x7F6E;&#x4E00;&#x4E2A; HashMap rigistry&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x5B58; String - beanDefinition &#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x5185;&#x7F6E;&#x4E00;&#x4E2A; ResourceLoader resourceLoader&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;&#x7528;&#x610F;&#x5728;&#x4E8E;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5411;&#x5176; loadBeanDefinitions() &#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8C03;&#x7528;&#x5176;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5E76;&#x628A;&#x89E3;&#x6790;&#x5230;&#x7684; BeanDefinition &#x4FDD;&#x5B58;&#x5230; registry &#x4E2D;&#x53BB;&#x3002;<br>XmlBeanDefinitionReader    &#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E86; loadBeanDefinitions() &#x65B9;&#x6CD5;&#xFF0C;&#x4ECE; XML &#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x7C7B;&#x5B9A;&#x4E49;&#x3002;<br>BeanFactory<br>&#x4EE5; BeanFactory &#x63A5;&#x53E3;&#x4E3A;&#x6838;&#x5FC3;&#x53D1;&#x6563;&#x51FA;&#x7684;&#x51E0;&#x4E2A;&#x7C7B;&#xFF0C;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x89E3;&#x51B3; IoC &#x5BB9;&#x5668;&#x5728; &#x5DF2;&#x7ECF;&#x83B7;&#x53D6; Bean &#x7684;&#x5B9A;&#x4E49;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x4F55;&#x88C5;&#x914D;&#x3001;&#x83B7;&#x53D6; Bean &#x5B9E;&#x4F8B; &#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>BeanFactory    &#x63A5;&#x53E3;&#xFF0C;&#x6807;&#x8BC6;&#x4E00;&#x4E2A; IoC &#x5BB9;&#x5668;&#x3002;&#x901A;&#x8FC7; getBean(String) &#x65B9;&#x6CD5;&#x6765; &#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;<br>AbstractBeanFactory    BeanFactory &#x7684;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x89C4;&#x8303;&#x4E86; IoC &#x5BB9;&#x5668;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x662F;&#x628A;&#x751F;&#x6210; Bean &#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7559;&#x7ED9;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x3002;IoC &#x5BB9;&#x5668;&#x7684;&#x7ED3;&#x6784;&#xFF1A;AbstractBeanFactory &#x7EF4;&#x62A4;&#x4E00;&#x4E2A; beanDefinitionMap &#x54C8;&#x5E0C;&#x8868;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x4FE1;&#x606F;&#xFF08;BeanDefinition&#xFF09;&#x3002;&#x83B7;&#x53D6; Bean &#x65F6;&#xFF0C;&#x5982;&#x679C; Bean &#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x4E4B;&#xFF0C;&#x5426;&#x5219;&#x5219;&#x8C03;&#x7528; doCreateBean &#x65B9;&#x6CD5;&#x88C5;&#x914D;&#x4E00;&#x4E2A; Bean&#x3002;&#xFF08;&#x6240;&#x8C13;&#x5B58;&#x5728;&#x4E8E;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x662F;&#x6307;&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; beanDefinitionMap &#x83B7;&#x53D6; BeanDefinition &#x8FDB;&#x800C;&#x901A;&#x8FC7;&#x5176; getBean() &#x65B9;&#x6CD5;&#x83B7;&#x53D6; Bean&#x3002;&#xFF09;<br>AutowireCapableBeanFactory    &#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x88C5;&#x914D;&#x7684; BeanFactory&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5DE5;&#x5382;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86; doCreateBean &#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5206;&#x4E09;&#x6B65;&#xFF1A;1&#xFF0C;&#x901A;&#x8FC7; BeanDefinition &#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x5B9E;&#x4F8B;&#x5316;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF1B;2&#xFF0C;&#x628A;&#x5BF9;&#x8C61;&#x4FDD;&#x5B58;&#x5728; BeanDefinition &#x4E2D;&#xFF0C;&#x4EE5;&#x5907;&#x4E0B;&#x6B21;&#x83B7;&#x53D6;&#xFF1B;3&#xFF0C;&#x4E3A;&#x5176;&#x88C5;&#x914D;&#x5C5E;&#x6027;&#x3002;&#x88C5;&#x914D;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x901A;&#x8FC7; BeanDefinition &#x4E2D;&#x7EF4;&#x62A4;&#x7684; PropertyValues &#x96C6;&#x5408;&#x7C7B;&#xFF0C;&#x628A; String - Value &#x952E;&#x503C;&#x5BF9;&#x6CE8;&#x5165;&#x5230; Bean &#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x53BB;&#x3002;&#x5982;&#x679C; Value &#x7684;&#x7C7B;&#x578B;&#x662F; BeanReference &#x5219;&#x8BF4;&#x660E;&#x5176;&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#xFF08;&#x5BF9;&#x5E94;&#x4E8E; XML &#x4E2D;&#x7684; ref&#xFF09;&#xFF0C;&#x901A;&#x8FC7; getBean &#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x83B7;&#x53D6;&#xFF0C;&#x7136;&#x540E;&#x6CE8;&#x5165;&#x5230;&#x5C5E;&#x6027;&#x4E2D;&#x3002;<br>ApplicationContext<br>&#x4EE5; ApplicationContext &#x63A5;&#x53E3;&#x4E3A;&#x6838;&#x5FC3;&#x53D1;&#x6563;&#x51FA;&#x7684;&#x51E0;&#x4E2A;&#x7C7B;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5BF9;&#x524D;&#x9762; Resouce &#x3001; BeanFactory&#x3001;BeanDefinition &#x8FDB;&#x884C;&#x4E86;&#x529F;&#x80FD;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x89E3;&#x51B3; &#x6839;&#x636E;&#x5730;&#x5740;&#x83B7;&#x53D6; IoC &#x5BB9;&#x5668;&#x5E76;&#x4F7F;&#x7528; &#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>ApplicationContext    &#x6807;&#x8BB0;&#x63A5;&#x53E3;&#xFF0C;&#x7EE7;&#x627F;&#x4E86; BeanFactory&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A; IoC &#x5BB9;&#x5668;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x901A;&#x8FC7; ResourceLoader &#x83B7;&#x53D6;&#x4E00;&#x4E2A; Resource&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x5BB9;&#x5668;&#x7684;&#x914D;&#x7F6E;&#x3001;Bean &#x7684;&#x5B9A;&#x4E49;&#x4FE1;&#x606F;&#x3002;&#x63A5;&#x7740;&#xFF0C;&#x4F7F;&#x7528; BeanDefinitionReader &#x8BFB;&#x53D6;&#x8BE5; Resource &#x4E2D;&#x7684; BeanDefinition &#x4FE1;&#x606F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x628A; BeanDefinition &#x4FDD;&#x5B58;&#x5728; BeanFactory &#x4E2D;&#xFF0C;&#x5BB9;&#x5668;&#x914D;&#x7F6E;&#x5B8C;&#x6BD5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x6CE8;&#x610F;&#x5230; BeanFactory &#x53EA;&#x5B9E;&#x73B0;&#x4E86; Bean &#x7684; &#x88C5;&#x914D;&#x3001;&#x83B7;&#x53D6;&#xFF0C;&#x5E76;&#x672A;&#x8BF4;&#x660E; Bean &#x7684; &#x6765;&#x6E90; &#x4E5F;&#x5C31;&#x662F; BeanDefinition &#x662F;&#x5982;&#x4F55; &#x52A0;&#x8F7D; &#x7684;&#x3002;&#x8BE5;&#x63A5;&#x53E3;&#x628A; BeanFactory &#x548C; BeanDefinitionReader &#x7ED3;&#x5408;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x3002;<br>AbstractApplicationContext    ApplicationContext &#x7684;&#x62BD;&#x8C61;&#x5B9E;&#x73B0;&#xFF0C;&#x5185;&#x90E8;&#x5305;&#x542B;&#x4E00;&#x4E2A; BeanFactory &#x7C7B;&#x3002;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x6709; getBean() &#x548C; refresh() &#x65B9;&#x6CD5;&#x3002;getBean() &#x76F4;&#x63A5;&#x8C03;&#x7528;&#x4E86;&#x5185;&#x7F6E; BeanFactory &#x7684; getBean() &#x65B9;&#x6CD5;&#xFF0C;refresh() &#x5219;&#x7528;&#x4E8E;&#x5B9E;&#x73B0; BeanFactory &#x7684;&#x5237;&#x65B0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x544A;&#x8BC9; BeanFactory &#x8BE5;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x8D44;&#x6E90;&#xFF08;Resource&#xFF09;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49;&#xFF08;BeanDefinition&#xFF09;&#x4FE1;&#x606F;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7559;&#x7ED9;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x7528;&#x4EE5;&#x5B9E;&#x73B0; &#x4ECE;&#x4E0D;&#x540C;&#x6765;&#x6E90;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49; &#x7684;&#x6548;&#x679C;&#x3002;<br>ClassPathXmlApplicationContext    &#x4ECE;&#x7C7B;&#x8DEF;&#x5F84;&#x52A0;&#x8F7D;&#x8D44;&#x6E90;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7C7B;&#x3002;&#x5185;&#x90E8;&#x901A;&#x8FC7; XmlBeanDefinitionReader &#x89E3;&#x6790; UrlResourceLoader &#x8BFB;&#x53D6;&#x5230;&#x7684; Resource&#xFF0C;&#x83B7;&#x53D6; BeanDefinition &#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x5230;&#x5185;&#x7F6E;&#x7684; BeanFactory &#x4E2D;&#x3002;<br>&#x6CE8; 1&#xFF1A;&#x5728; Spring &#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5BF9; ApplicatinoContext &#x7684;&#x5206;&#x5C42;&#x66F4;&#x4E3A;&#x7EC6;&#x81F4;&#x3002;AbstractApplicationContext &#x4E2D;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0; &#x4E0D;&#x540C;&#x6765;&#x6E90; &#x7684; &#x4E0D;&#x540C;&#x7C7B;&#x578B; &#x7684;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49;&#xFF0C;&#x628A;&#x8FD9;&#x4E24;&#x6B65;&#x5206;&#x5C42;&#x5B9E;&#x73B0;&#x3002;&#x4EE5;&#x201C;&#x4ECE;&#x7C7B;&#x8DEF;&#x5F84;&#x8BFB;&#x53D6; XML &#x5B9A;&#x4E49;&#x201D;&#x4E3A;&#x4F8B;&#xFF0C;&#x9996;&#x5148;&#x4F7F;&#x7528; AbstractXmlApplicationContext &#x6765;&#x5B9E;&#x73B0; &#x4E0D;&#x540C;&#x7C7B;&#x578B; &#x7684;&#x8D44;&#x6E90;&#x89E3;&#x6790;&#xFF0C;&#x63A5;&#x7740;&#xFF0C;&#x901A;&#x8FC7; ClassPathXmlApplicationContext &#x6765;&#x5B9E;&#x73B0; &#x4E0D;&#x540C;&#x6765;&#x6E90; &#x7684;&#x8D44;&#x6E90;&#x89E3;&#x6790;&#x3002;<br>&#x6CE8; 2&#xFF1A;&#x5728; tiny-spring &#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5148;&#x7528; BeanDefinitionReader &#x8BFB;&#x53D6; BeanDefiniton &#x540E;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x7F6E;&#x7684; registry &#xFF08;&#x952E;&#x503C;&#x5BF9;&#x4E3A; String - BeanDefinition &#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x901A;&#x8FC7; getRigistry() &#x83B7;&#x53D6;&#xFF09;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7531; ApplicationContext &#x628A; BeanDefinitionReader &#x4E2D; registry &#x7684;&#x952E;&#x503C;&#x5BF9;&#x4E00;&#x4E2A;&#x4E2A;&#x8D4B;&#x503C;&#x7ED9; BeanFactory &#x4E2D;&#x4FDD;&#x5B58;&#x7684; beanDefinitionMap&#x3002;&#x800C;&#x5728; Spring &#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;BeanDefinitionReader &#x76F4;&#x63A5;&#x64CD;&#x4F5C; BeanDefinition &#xFF0C;&#x5B83;&#x7684; getRegistry() &#x83B7;&#x53D6;&#x7684;&#x4E0D;&#x662F;&#x5185;&#x7F6E;&#x7684; registry&#xFF0C;&#x800C;&#x662F; BeanFactory &#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;&#x4EE5; DefaultListableBeanFactory &#x4E3A;&#x4F8B;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A; BeanDefinitonRigistry &#x63A5;&#x53E3;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x628A; BeanDefinition &#x7684; &#x6CE8;&#x518C; &#x3001;&#x83B7;&#x53D6; &#x7B49;&#x65B9;&#x6CD5;&#x90FD;&#x66B4;&#x9732;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;BeanDefinitionReader &#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x628A; BeanDefiniton &#x76F4;&#x63A5;&#x52A0;&#x8F7D;&#x5230; BeanFactory &#x4E2D;&#x53BB;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;<br>&#x6CE8;&#xFF1A;&#x6B64;&#x5904;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5206;&#x6790;&#x4E0D;&#x9650;&#x4E8E; tiny-spring&#xFF0C;&#x4E5F;&#x5305;&#x62EC; Spring &#x672C;&#x8EAB;&#x7684;&#x5185;&#x5BB9;</p>
<p>&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;<br>&#x8BE5;&#x6A21;&#x5F0F;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x5728; BeanFactory &#x4E2D;&#xFF0C;&#x628A; getBean() &#x4EA4;&#x7ED9;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7C7B; **BeanFactory &#x5BF9;&#x5176;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;<br>&#x5728; tiny-spring &#x4E2D;&#xFF08;Spring &#x4E2D;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x4F46;&#x4E0D;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF09;&#xFF0C;ApplicationContext &#x7EE7;&#x627F;&#x4E86; BeanFactory &#x63A5;&#x53E3;&#xFF0C;&#x5177;&#x5907;&#x4E86; getBean() &#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x5185;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A; BeanFactory &#x5B9E;&#x4F8B;&#xFF0C;getBean() &#x76F4;&#x63A5;&#x8C03;&#x7528; BeanFactory &#x7684; getBean() &#x3002;&#x4F46;&#x662F;ApplicationContext &#x52A0;&#x5F3A;&#x4E86; BeanFactory&#xFF0C;&#x5B83;&#x628A;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x52A0;&#x8F7D;&#x4E5F;&#x5305;&#x542B;&#x8FDB;&#x53BB;&#x4E86;&#x3002;</p>
<p>AOP &#x7684;&#x5B9E;&#x73B0;<br>&#x91CD;&#x65B0;&#x5206;&#x6790; IoC &#x5BB9;&#x5668;<br>&#x6CE8;&#xFF1A;&#x4EE5;&#x4E0B;&#x6240;&#x8BF4;&#x7684; BeanFactory &#x548C; ApplicationContext &#x4E0D;&#x662F;&#x6307;&#x7684;&#x90A3;&#x51E0;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x63A5;&#x53E3;&#x7C7B;&#xFF08;&#x4F8B;&#x5982; BeanFactory &#x63A5;&#x53E3;&#xFF0C;&#x5B83;&#x9664;&#x4E86; getBean &#x7A7A;&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x65E0;&#x6CD5;&#x7528;&#x6765;&#x5206;&#x6790;&#x3002;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x8FD9;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;&#x603B;&#x4F53;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6BD4;&#x5982; ClasspathXmlApplicationContext&#x3001;FileSystemXmlApplicationContext &#x90FD;&#x7B97;&#x662F; ApplicationContext&#x3002;</p>
<p>BeanFactory &#x7684;&#x6784;&#x9020;&#x4E0E;&#x6267;&#x884C;<br>BeanFactory &#x7684;&#x6838;&#x5FC3;&#x65B9;&#x6CD5;&#x662F; getBean(String) &#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x4ECE;&#x5DE5;&#x5382;&#x4E2D;&#x53D6;&#x51FA;&#x6240;&#x9700;&#x8981;&#x7684; Bean &#x3002;AbstractBeanFactory &#x89C4;&#x5B9A;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x6784;&#x9020;&#x548C;&#x6267;&#x884C;&#x6D41;&#x7A0B;&#x3002;</p>
<p>getBean &#x7684;&#x6D41;&#x7A0B;&#xFF1A;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x5316;&#x548C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x751F;&#x6210; Bean&#xFF0C;&#x518D;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x3002;</p>
<p>doCreateBean &#xFF1A;&#x5B9E;&#x4F8B;&#x5316; Bean&#x3002;<br>a. createInstance &#xFF1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#x3002;<br>b. applyProperties &#xFF1A;&#x6CE8;&#x5165;&#x5C5E;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C; Bean &#x5B9E;&#x73B0;&#x4E86; BeanFactoryAware &#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x5C06;&#x5BB9;&#x5668;&#x7684;&#x5F15;&#x7528;&#x4F20;&#x5165;&#x5230; Bean &#x4E2D;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;Bean &#x5C06;&#x83B7;&#x53D6;&#x5BF9;&#x5BB9;&#x5668;&#x64CD;&#x4F5C;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x4E5F;&#x5C31;&#x5141;&#x8BB8;&#x4E86; &#x7F16;&#x5199;&#x6269;&#x5C55; IoC &#x5BB9;&#x5668;&#x7684;&#x529F;&#x80FD;&#x7684; Bean&#x3002;<br>initializeBean(bean) &#xFF1A; &#x521D;&#x59CB;&#x5316; Bean&#x3002;<br>a. &#x4ECE; BeanPostProcessor &#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x4F9D;&#x6B21;&#x53D6;&#x51FA; BeanPostProcessor &#x6267;&#x884C; bean = postProcessBeforeInitialization(bean,beanName) &#x3002;&#xFF08;&#x4E3A;&#x4EC0;&#x4E48;&#x8C03;&#x7528; BeanPostProceesor &#x4E2D;&#x63D0;&#x4F9B;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4E0D;&#x662F;&#x76F4;&#x63A5; post&#x2026;(bean,beanName) &#x800C;&#x662F; bean = post&#x2026;(bean,beanName) &#x5462;&#xFF1F;&#x89C1;&#x5206;&#x6790;1 &#x3002;&#x53E6;&#x5916;&#xFF0C;BeanPostProcessor &#x5217;&#x8868;&#x7684;&#x83B7;&#x53D6;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x89C1;&#x5206;&#x6790;2&#x3002;&#xFF09;<br>b. &#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#xFF08;tiny-spring &#x672A;&#x5B9E;&#x73B0;&#x5BF9;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x7684;&#x652F;&#x6301;&#xFF09;&#x3002;<br>c. &#x4ECE; BeanPostProcessor &#x5217;&#x8868;&#x4E2D;&#xFF0C; &#x4F9D;&#x6B21;&#x53D6;&#x51FA; BeanPostProcessor &#x6267;&#x884C;&#x5176; bean = postProcessAfterInitialization(bean,beanName)&#x3002;<br>ApplicationContext &#x7684;&#x6784;&#x9020;&#x548C;&#x6267;&#x884C;<br>ApplicationContext &#x7684;&#x6838;&#x5FC3;&#x65B9;&#x6CD5;&#x662F; refresh() &#x65B9;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x4ECE;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49;&#x3001;&#x6269;&#x5C55;&#x5BB9;&#x5668;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>refresh &#x7684;&#x6D41;&#x7A0B;&#xFF1A;</p>
<p>loadBeanDefinitions(BeanFactory) &#xFF1A;&#x52A0;&#x8F7D;&#x7C7B;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x6CE8;&#x5165;&#x5230;&#x5185;&#x7F6E;&#x7684; BeanFactory &#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5728;&#x4E8E;&#xFF0C;&#x672A;&#x5BF9;&#x52A0;&#x8F7D;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0D;&#x540C;&#x6765;&#x6E90;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#x3002;<br>registerBeanPostProcessors(BeanFactory) &#xFF1A;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x7684; BeanPostProcessor&#xFF0C;&#x5E76;&#x6CE8;&#x518C;&#x5230; BeanFactory &#x7EF4;&#x62A4;&#x7684; BeanPostProcessor &#x5217;&#x8868;&#x53BB;&#x3002;<br>onRefresh &#xFF1A;<br>a. preInstantiateSingletons &#xFF1A;&#x4EE5;&#x5355;&#x4F8B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6709; Bean&#x3002;tiny-spring &#x53EA;&#x652F;&#x6301; singleton &#x6A21;&#x5F0F;&#x3002;<br>IoC &#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8003;&#x4E0E;&#x5206;&#x6790;<br>&#x5206;&#x6790; 1&#xFF1A;AOP &#x53EF;&#x4EE5;&#x5728;&#x4F55;&#x5904;&#x88AB;&#x5D4C;&#x5165;&#x5230; IoC &#x5BB9;&#x5668;&#x4E2D;&#x53BB;&#xFF1F;<br>&#x5728; Bean &#x7684;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x8C03;&#x7528; BeanPostProcessor &#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x3002;&#x5728;&#x5B83;&#x7684; postProcess&#x2026;Initialization &#x65B9;&#x6CD5;&#x4E2D;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A; Bean&#xFF0C;&#x8FD9;&#x4E2A;&#x8FD4;&#x56DE;&#x7684; Bean &#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x539F;&#x6765;&#x4F20;&#x5165;&#x7684; Bean &#x4E86;&#xFF0C;&#x8FD9;&#x4E3A;&#x5B9E;&#x73B0; AOP &#x7684;&#x4EE3;&#x7406;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x80FD;&#xFF01;&#x4EE5; JDK &#x63D0;&#x4F9B;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x4E3A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x65B9;&#x6CD5;&#x8981;&#x6C42;&#x4F20;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x4E86; IObj &#x63A5;&#x53E3;&#xFF0C;&#x5B9E;&#x9645;&#x4F20;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x662F; Obj&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#xFF0C;&#x53EF;&#x4EE5; &#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x4E86; IObj &#x63A5;&#x53E3;&#x5E76;&#x628A; Obj &#x4F5C;&#x4E3A;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7406;&#x7C7B; Proxy &#x8FD4;&#x56DE;&#xFF0C;&#x6B64;&#x65F6; Bean &#x5DF2;&#x7ECF;&#x88AB;&#x5077;&#x5077;&#x6362;&#x6210;&#x4E86;&#x5B83;&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#x3002;</p>
<p>&#x5206;&#x6790; 2&#xFF1A;BeanFactory &#x548C; ApplicationContext &#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x8026;&#x5408;<br>BeanFactory &#x4E2D;&#x7684; BeanPostProcessor &#x7684;&#x5217;&#x8868;&#x662F;&#x54EA;&#x91CC;&#x751F;&#x6210;&#x7684;&#x5462;&#xFF1F;&#x662F;&#x5728; ApplicationContext &#x4E2D;&#x7684; refresh &#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x8FD9;&#x91CC;&#x8BBE;&#x8BA1;&#x4E0A;&#x5E94;&#x8BE5;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6309;&#x7406;&#x8BF4; ApplicationContext &#x662F;&#x57FA;&#x4E8E; BeanFactory &#x7684;&#xFF0C;BeanFactory &#x7684;&#x5C5E;&#x6027;&#x7684;&#x83B7;&#x53D6;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x4F9D;&#x8D56;&#x4E8E; ApplicationContext &#x7684;&#x8C03;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x5206;&#x6790; 3&#xFF1A;tiny-spring &#x603B;&#x4F53;&#x6D41;&#x7A0B;&#x7684;&#x5206;&#x6790;<br>&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;tiny-spring &#x7684; ApplicaitonContext &#x4F7F;&#x7528;&#x6D41;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A; </p>
<ol>
<li>ApplicationContext &#x5B8C;&#x6210;&#x4E86;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x52A0;&#x8F7D;&#xFF0C;&#x5E76;&#x6CE8;&#x518C;&#x5230; BeanFactory &#x4E2D;&#x53BB;&#x3002; </li>
<li>ApplicationContext &#x4ECE; BeanFactory &#x4E2D;&#x5BFB;&#x627E; BeanPostProcessor&#xFF0C;&#x6CE8;&#x518C;&#x5230; BeanFactory<br>&#x7EF4;&#x62A4;&#x7684; BeanPostProcessor &#x5217;&#x8868;&#x4E2D;&#x53BB;&#x3002; </li>
<li>ApplicationContext &#x4EE5;&#x5355;&#x4F8B;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x4E3B;&#x52A8;&#x8C03;&#x7528; getBean &#x5B9E;&#x4F8B;&#x5316;&#x3001;&#x6CE8;&#x5165;&#x5C5E;&#x6027;&#x3001;&#x7136;&#x540E;&#x521D;&#x59CB;&#x5316; BeanFactory &#x4E2D;&#x6240;&#x6709;&#x7684; Bean&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x7684; BeanPostProcessor &#x90FD;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C; 2 &#x6B65;&#x4E2D;&#x5B8C;&#x6210;&#x5B9E;&#x4F8B;&#x5316;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x63A5;&#x4E0B;&#x6765;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x662F;&#x666E;&#x901A; Bean&#xFF0C;&#x56E0;&#x6B64;&#x666E;&#x901A; Bean &#x7684;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x3002; </li>
<li>&#x8C03;&#x7528; getBean &#x65F6;&#xFF0C;&#x59D4;&#x6258;&#x7ED9; BeanFactory&#xFF0C;&#x6B64;&#x65F6;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x8FD4;&#x56DE;&#x6BCF;&#x4E2A; Bean &#x5355;&#x4F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684; Bean &#x5B9E;&#x4F8B;&#x5728;&#x7B2C;&#x4E09;&#x6B65;&#x90FD;&#x5DF2;&#x7ECF;&#x751F;&#x6210;&#x4E86;&#x3002;</li>
</ol>
<p>JDK &#x5BF9;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x652F;&#x6301;<br>JDK &#x4E2D;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x7C7B;&#xFF1A;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>Proxy    &#x6765;&#x81EA; JDK API&#x3002;&#x63D0;&#x4F9B;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7; Object newProxyInstance(ClassLoader loader, Class&lt;?&gt;[] interfaces, InvocationHandler h) &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x3002;<br>InvocationHandler    &#x6765;&#x81EA; JDK API&#x3002;&#x901A;&#x8FC7; Object invoke(Object proxy, Method method,Object[] args) &#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x4E2D;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x548C;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x3002;<br>&#x5047;&#x8BBE;&#x4EE5;&#x4E0B;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>&#x5BF9;&#x8C61; obj &#x5B9E;&#x73B0;&#x4E86; IObj &#x63A5;&#x53E3;&#xFF0C;&#x63A5;&#x53E3;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5; func(Object[] args)&#x3002;<br>&#x5BF9;&#x8C61; handler &#x662F; InvocationHandler &#x7684;&#x5B9E;&#x4F8B;&#x3002;<br>&#x90A3;&#x4E48;&#xFF0C;&#x901A;&#x8FC7; Proxy &#x7684; newProxyInstance(obj.getClassLoader(), obj.getClass().getInterfaces(), handler&#xFF0C;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE; obj &#x7684;&#x4EE3;&#x7406;&#x5BF9;&#x8C61; proxy&#x3002;</p>
<p>&#x5F53;&#x8C03;&#x7528; proxy.func(args) &#x65F6;&#xFF0C;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x5C06;&#x59D4;&#x6258;&#x7ED9; handler.invoke(proxy, func, args) &#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728; handler &#x7684; invoke &#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5BF9;&#x65B9;&#x6CD5;&#x62E6;&#x622A;&#x7684;&#x5904;&#x7406;&#x3002;&#x53EF;&#x4EE5;&#x5148;&#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x62E6;&#x622A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF08;&#x6BD4;&#x5982;&#x5148;&#x505A;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x518D;&#x8C03;&#x7528;&#x539F;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5BF9;&#x5E94;&#x4E86; Spring &#x4E2D;&#x7684;&#x524D;&#x7F6E;&#x901A;&#x77E5;&#xFF09;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x539F;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>AOP &#x7684;&#x690D;&#x5165;&#x4E0E;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;<br>&#x5728; Bean &#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B8C;&#x6210; AOP &#x7684;&#x690D;&#x5165;<br>&#x89E3;&#x51B3; AOP &#x7684;&#x690D;&#x5165;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x89E3;&#x51B3; &#x5728; IoC &#x5BB9;&#x5668;&#x7684;&#x4F55;&#x5904;&#x690D;&#x5165; AOP &#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x6B21;&#x8981;&#x89E3;&#x51B3; &#x4E3A;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B; AOP &#x7684;&#x690D;&#x5165; &#x7684;&#x95EE;&#x9898;&#x3002;<br>tiny-spring &#x4E2D; AspectJAwareAdvisorAutoProxyCreator &#x7C7B;&#xFF08;&#x4EE5;&#x4E0B;&#x7B80;&#x79F0; AutoProxyCreator&#xFF09;&#x662F;&#x5B9E;&#x73B0; AOP &#x690D;&#x5165;&#x7684;&#x5173;&#x952E;&#x7C7B;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x63A5;&#x53E3;&#xFF1A;</p>
<p>BeanPostProcessor &#xFF1A;&#x5728; postProcessorAfterInitialization &#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x3002;&#x89E3;&#x51B3;&#x4E86; &#x5728; IoC &#x5BB9;&#x5668;&#x7684;&#x4F55;&#x5904;&#x690D;&#x5165; AOP &#x7684;&#x95EE;&#x9898;&#x3002;<br>BeanFactoryAware &#xFF1A;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9; BeanFactory &#x7684;&#x611F;&#x77E5;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x662F;&#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x4E00;&#x4E2A; Bean&#xFF0C;&#x5374;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5BB9;&#x5668;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x8FDB;&#x800C;&#x83B7;&#x53D6;&#x5BB9;&#x5668;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5207;&#x70B9;&#x5BF9;&#x8C61;&#xFF0C;&#x51B3;&#x5B9A;&#x5BF9;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x54EA;&#x4E9B;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4EE3;&#x7406;&#x3002;&#x89E3;&#x51B3;&#x4E86; &#x4E3A;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B; AOP &#x7684;&#x690D;&#x5165; &#x7684;&#x95EE;&#x9898;&#x3002;<br>AOP &#x4E2D;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5B9E;&#x73B0;&#x6B65;&#x9AA4;<br>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5185;&#x5BB9;<br>&#x9996;&#x5148;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x62E6;&#x622A;&#x54EA;&#x4E2A;&#x5BF9;&#x8C61;&#x3001;&#x5728;&#x54EA;&#x4E2A;&#x65B9;&#x6CD5;&#x62E6;&#x622A;&#x3001;&#x62E6;&#x622A;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#xFF09;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x7C7B;&#xFF1A;</p>
<p>&#x7C7B;&#x540D;    &#x8BF4;&#x660E;<br>PointcutAdvisor    &#x5207;&#x70B9;&#x901A;&#x77E5;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x63D0;&#x4F9B; &#x5BF9;&#x54EA;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x54EA;&#x4E2A;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x62E6;&#x622A; &#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x3002;&#x901A;&#x8FC7;&#x5B83;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x5207;&#x70B9;&#x5BF9;&#x8C61; Pointcut &#x548C;&#x4E00;&#x4E2A;&#x901A;&#x77E5;&#x5668;&#x5BF9;&#x8C61; Advisor&#x3002;<br>Pointcut    &#x5207;&#x70B9;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A; ClassFilter &#x5BF9;&#x8C61;&#x548C;&#x4E00;&#x4E2A; MethodMatcher &#x5BF9;&#x8C61;&#x3002;&#x524D;&#x8005;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5BF9;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF08;&#x7528;&#x4E8E; &#x7B5B;&#x9009;&#x8981;&#x4EE3;&#x7406;&#x7684;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x540E;&#x8005;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5BF9;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF08;&#x7528;&#x4E8E; &#x5728;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x4E2D;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF09;&#x3002;<br>Advisor    &#x901A;&#x77E5;&#x5668;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x901A;&#x77E5;&#x5BF9;&#x8C61; Advice &#x3002;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x5B9E;&#x73B0; &#x5177;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x62E6;&#x622A;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8005;&#x7F16;&#x5199;&#xFF0C;&#x4E5F;&#x5C31;&#x5BF9;&#x5E94;&#x4E86; Spring &#x4E2D;&#x7684;&#x524D;&#x7F6E;&#x901A;&#x77E5;&#x3001;&#x540E;&#x7F6E;&#x901A;&#x77E5;&#x3001;&#x73AF;&#x5207;&#x901A;&#x77E5;&#x7B49;&#x3002;<br>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x6B65;&#x9AA4;<br>&#x63A5;&#x7740;&#x8981;&#x77E5;&#x9053;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;</p>
<p>AutoProxyCreator&#xFF08;&#x5B9E;&#x73B0;&#x4E86; BeanPostProcessor &#x63A5;&#x53E3;&#xFF09;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x6240;&#x6709;&#x7684; Bean &#x524D;&#xFF0C;&#x6700;&#x5148;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x3002;<br>&#x5176;&#x4ED6;&#x666E;&#x901A; Bean &#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x3001;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5728;&#x521D;&#x59CB;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;AutoProxyCreator &#x52A0;&#x8F7D; BeanFactory &#x4E2D;&#x6240;&#x6709;&#x7684; PointcutAdvisor&#xFF08;&#x8FD9;&#x4E5F;&#x4FDD;&#x8BC1;&#x4E86; PointcutAdvisor &#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x987A;&#x5E8F;&#x4F18;&#x4E8E;&#x666E;&#x901A; Bean&#x3002;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4F9D;&#x6B21;&#x4F7F;&#x7528; PointcutAdvisor &#x5185;&#x7F6E;&#x7684; ClassFilter&#xFF0C;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x62E6;&#x622A;&#x7684;&#x7C7B;&#x3002;<br>&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x751F;&#x6210;&#x4E00;&#x4E2A; TargetSource&#xFF08;&#x8981;&#x62E6;&#x622A;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x5176;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x5E76;&#x53D6;&#x51FA; AutoProxyCreator &#x7684; MethodMatcher&#xFF08;&#x5BF9;&#x54EA;&#x4E9B;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x62E6;&#x622A;&#xFF09;&#x3001;Advice&#xFF08;&#x62E6;&#x622A;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#xFF09;&#xFF0C;&#x518D;&#xFF0C;&#x4EA4;&#x7ED9; AopProxy &#x53BB;&#x751F;&#x6210;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x3002;<br>AopProxy &#x751F;&#x6210;&#x4E00;&#x4E2A; InvocationHandler&#xFF0C;&#x5728;&#x5B83;&#x7684; invoke &#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x4F7F;&#x7528; MethodMatcher &#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x62E6;&#x622A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5219;&#x4EA4;&#x7ED9; Advice &#x6765;&#x6267;&#x884C;&#xFF08;Advice &#x7531;&#x7528;&#x6237;&#x6765;&#x7F16;&#x5199;&#xFF0C;&#x5176;&#x4E2D;&#x4E5F;&#x8981;&#x624B;&#x52A8;/&#x81EA;&#x52A8;&#x8C03;&#x7528;&#x539F;&#x59CB;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x4EA4;&#x7ED9; TargetSource &#x7684;&#x539F;&#x59CB;&#x5BF9;&#x8C61;&#x6765;&#x6267;&#x884C;&#x3002;<br>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;<br>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;<br>&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x5B9E;&#x73B0;&#xFF0C;&#x89C1;&#x5206;&#x6790;1&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;<br>&#x751F;&#x6210;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; JDK &#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C; Cglib &#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x53EF;&#x4EE5;&#x59D4;&#x6258;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E3A; tiny-spring &#x6DFB;&#x52A0;&#x62E6;&#x622A;&#x5668;&#x94FE;<br>tiny-spring &#x4E0D;&#x652F;&#x6301;&#x62E6;&#x622A;&#x5668;&#x94FE;&#xFF0C;&#x53EF;&#x4EE5;&#x6A21;&#x4EFF; Spring &#x4E2D;&#x62E6;&#x622A;&#x5668;&#x94FE;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5B9E;&#x73B0;&#x5BF9;&#x591A;&#x62E6;&#x622A;&#x5668;&#x7684;&#x652F;&#x6301;&#x3002;<br>tiny-spring &#x4E2D;&#x7684; proceed() &#x65B9;&#x6CD5;&#x662F;&#x8C03;&#x7528;&#x539F;&#x59CB;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5; method.invoke(object,args)&#x3002;&#xFF08;&#x53C2;&#x89C1; ReflectiveMethodInvocation &#x7C7B;)<br>&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x591A;&#x62E6;&#x622A;&#x5668;&#xFF0C;&#x505A;&#x51FA;&#x4EE5;&#x4E0B;&#x4FEE;&#x6539;&#xFF1A;</p>
<p>&#x5C06; proceed() &#x65B9;&#x6CD5;&#x4FEE;&#x6539;&#x4E3A;&#x8C03;&#x7528;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5; method.invoke(proxy,args)&#x3002;<br>&#x5728;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684; InvocationHandler &#x7684; invoke &#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x67E5;&#x770B;&#x62E6;&#x622A;&#x5668;&#x5217;&#x8868;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x62E6;&#x622A;&#x5668;&#xFF0C;&#x5219;&#x8C03;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x62E6;&#x622A;&#x5668;&#x5E76;&#x8FD4;&#x56DE;&#xFF0C;&#x5426;&#x5219;&#x8C03;&#x7528;&#x539F;&#x59CB;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x8F93;&#x5165;&#x6B63;&#x6587;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>
        
        
        
    </div>
</div>









    
<div class="card card-transparent">
    <nav class="pagination is-centered" role="navigation" aria-label="pagination">
        <div class="pagination-previous">
            <a class="is-flex-grow has-text-black-ter" href="/page/5/">Anterior</a>
        </div>
        <div class="pagination-next">
            <a class="is-flex-grow has-text-black-ter" href="/page/7/">Siguiente</a>
        </div>
        <ul class="pagination-list is-hidden-mobile">
            
            <li><a class="pagination-link has-text-black-ter" href="/">1</a></li>
            
            <li><span class="pagination-ellipsis has-text-black-ter">&hellip;</span></li>
            
            <li><a class="pagination-link has-text-black-ter" href="/page/5/">5</a></li>
            
            <li><a class="pagination-link is-current" href="/page/6/">6</a></li>
            
            <li><a class="pagination-link has-text-black-ter" href="/page/7/">7</a></li>
            
        </ul>
    </nav>
</div>
</div>
                




<div class="column is-4-tablet is-4-desktop is-3-widescreen  has-order-1 column-left ">
    
        
<div class="card widget">
    <div class="card-content">
        <nav class="level">
            <div class="level-item has-text-centered">
                <div>
                    
                        <figure class="image is-128x128 has-mb-6">
                            <img class="is-rounded" src="https://gitee.com/IvanLu1024/picts/raw/master/personal/IMG_ivan.jpg" alt="Ivan Lu">
                        </figure>
                    
                    
                    <p class="is-size-4 is-block">
                        Ivan Lu
                    </p>
                    
                    
                    <p class="is-size-6 is-block">
                        Student
                    </p>
                    
                    
                    <p class="is-size-6 is-flex is-flex-center has-text-grey">
                        <i class="fas fa-map-marker-alt has-mr-7"></i>
                        <span>Nanjing,China</span>
                    </p>
                    
                </div>
            </div>
        </nav>
        <nav class="level is-mobile">
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Entradas
                    </p>
                    <p class="title has-text-weight-normal">
                        19
                    </p>
                </div>
            </div>
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Categoria
                    </p>
                    <p class="title has-text-weight-normal">
                        1
                    </p>
                </div>
            </div>
            <div class="level-item has-text-centered is-marginless">
                <div>
                    <p class="heading">
                        Etiquetas
                    </p>
                    <p class="title has-text-weight-normal">
                        16
                    </p>
                </div>
            </div>
        </nav>
        <div class="level">
            <a class="level-item button is-link is-rounded" href="https://github.com/IvanLu1024" target="_blank">
                SEGUIR</a>
        </div>
        
        
        <div class="level is-mobile">
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Github" href="https://github.com/IvanLu1024">
                
                <i class="fab fa-github"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Facebook" href="https://facebook.com">
                
                <i class="fab fa-facebook"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Twitter" href="https://twitter.com">
                
                <i class="fab fa-twitter"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="Dribbble" href="https://dribbble.com">
                
                <i class="fab fa-dribbble"></i>
                
            </a>
            
            <a class="level-item button is-white is-marginless" target="_blank"
                title="RSS" href="/">
                
                <i class="fas fa-rss"></i>
                
            </a>
            
        </div>
        
    </div>
</div>
    
        
    
        

<div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Links
        </h3>
        <ul class="menu-list">
        
            <li>
                <a class="level is-mobile" href="https://hexo.io" target="_blank">
                    <span class="level-left">
                        <span class="level-item">Hexo</span>
                    </span>
                    <span class="level-right">
                        <span class="level-item tag">hexo.io</span>
                    </span>
                </a>
            </li>
        
            <li>
                <a class="level is-mobile" href="https://github.com/ppoffice" target="_blank">
                    <span class="level-left">
                        <span class="level-item">PPOffice</span>
                    </span>
                    <span class="level-right">
                        <span class="level-item tag">github.com</span>
                    </span>
                </a>
            </li>
        
        </ul>
        </div>
    </div>
</div>


    
        
<div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Categorias
            </h3>
            <ul class="menu-list">
            <li>
        <a class="level is-marginless" href="/categories/读书笔记/">
            <span class="level-start">
                <span class="level-item">读书笔记</span>
            </span>
            <span class="level-end">
                <span class="level-item tag">1</span>
            </span>
        </a></li>
            </ul>
        </div>
    </div>
</div>
    
        
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Nube de etiquetas
        </h3>
        <a href="/tags/HBase/" style="font-size: 10px;">HBase</a> <a href="/tags/HTTP/" style="font-size: 10px;">HTTP</a> <a href="/tags/I-O多路复用/" style="font-size: 10px;">I/O多路复用</a> <a href="/tags/JVM/" style="font-size: 10px;">JVM</a> <a href="/tags/Java/" style="font-size: 10px;">Java</a> <a href="/tags/Java并发/" style="font-size: 10px;">Java并发</a> <a href="/tags/Kafka/" style="font-size: 10px;">Kafka</a> <a href="/tags/Redis/" style="font-size: 10px;">Redis</a> <a href="/tags/Spring/" style="font-size: 10px;">Spring</a> <a href="/tags/《谷歌方法论》/" style="font-size: 15px;">《谷歌方法论》</a> <a href="/tags/网站架构/" style="font-size: 10px;">网站架构</a> <a href="/tags/网络/" style="font-size: 10px;">网络</a> <a href="/tags/论文笔记/" style="font-size: 20px;">论文笔记</a> <a href="/tags/读书笔记/" style="font-size: 20px;">读书笔记</a> <a href="/tags/锁/" style="font-size: 10px;">锁</a> <a href="/tags/面试题/" style="font-size: 10px;">面试题</a>
    </div>
</div>

    
    
        <div class="column-right-shadow is-hidden-widescreen ">
        
            
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Recientes
        </h3>
        
        <article class="media">
            
            <a href="/2019/05/24/IO多路复用总结/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="有关I/O多路复用的总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-23T16:00:00.000Z">2019-05-24</time></div>
                    <a href="/2019/05/24/IO多路复用总结/" class="has-link-black-ter is-size-6">有关I/O多路复用的总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/23/redis/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="Redis常见面试题总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-22T16:00:00.000Z">2019-05-23</time></div>
                    <a href="/2019/05/23/redis/" class="has-link-black-ter is-size-6">Redis常见面试题总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/18/HBase/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="HBase笔记总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-17T16:00:00.000Z">2019-05-18</time></div>
                    <a href="/2019/05/18/HBase/" class="has-link-black-ter is-size-6">HBase笔记总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="《大型网站技术架构》读书笔记——第1篇 概述">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-23T16:00:00.000Z">2019-03-24</time></div>
                    <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="has-link-black-ter is-size-6">《大型网站技术架构》读书笔记——第1篇 概述</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time></div>
                    <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="has-link-black-ter is-size-6">论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
    </div>
</div>

        
            <div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Archivos
        </h3>
        <ul class="menu-list">
        
        <li>
            <a class="level is-marginless" href="/archives/2019/05/">
                <span class="level-start">
                    <span class="level-item">May 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">3</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/03/">
                <span class="level-start">
                    <span class="level-item">March 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">9</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/02/">
                <span class="level-start">
                    <span class="level-item">February 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">5</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2018/10/">
                <span class="level-start">
                    <span class="level-item">October 2018</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">2</span>
                </span>
            </a>
        </li>
        
        </ul>
        </div>
    </div>
</div>
        
            <div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Etiquetas
            </h3>
            <div class="field is-grouped is-grouped-multiline">
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HBase/">
                        <span class="tag">HBase</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HTTP/">
                        <span class="tag">HTTP</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/I-O多路复用/">
                        <span class="tag">I/O多路复用</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/JVM/">
                        <span class="tag">JVM</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java/">
                        <span class="tag">Java</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java并发/">
                        <span class="tag">Java并发</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Kafka/">
                        <span class="tag">Kafka</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Redis/">
                        <span class="tag">Redis</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Spring/">
                        <span class="tag">Spring</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/《谷歌方法论》/">
                        <span class="tag">《谷歌方法论》</span>
                        <span class="tag is-grey">4</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网站架构/">
                        <span class="tag">网站架构</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网络/">
                        <span class="tag">网络</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/论文笔记/">
                        <span class="tag">论文笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/读书笔记/">
                        <span class="tag">读书笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/锁/">
                        <span class="tag">锁</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/面试题/">
                        <span class="tag">面试题</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
            </div>
        </div>
    </div>
</div>
        
        </div>
    
</div>

                




<div class="column is-4-tablet is-4-desktop is-3-widescreen is-hidden-touch is-hidden-desktop-only has-order-3 column-right ">
    
        
<div class="card widget">
    <div class="card-content">
        <h3 class="menu-label">
            Recientes
        </h3>
        
        <article class="media">
            
            <a href="/2019/05/24/IO多路复用总结/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="有关I/O多路复用的总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-23T16:00:00.000Z">2019-05-24</time></div>
                    <a href="/2019/05/24/IO多路复用总结/" class="has-link-black-ter is-size-6">有关I/O多路复用的总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/23/redis/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="Redis常见面试题总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-22T16:00:00.000Z">2019-05-23</time></div>
                    <a href="/2019/05/23/redis/" class="has-link-black-ter is-size-6">Redis常见面试题总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/05/18/HBase/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="HBase笔记总结">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-05-17T16:00:00.000Z">2019-05-18</time></div>
                    <a href="/2019/05/18/HBase/" class="has-link-black-ter is-size-6">HBase笔记总结</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="《大型网站技术架构》读书笔记——第1篇 概述">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-23T16:00:00.000Z">2019-03-24</time></div>
                    <a href="/2019/03/24/《大型网站技术架构》读书笔记00/" class="has-link-black-ter is-size-6">《大型网站技术架构》读书笔记——第1篇 概述</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
        <article class="media">
            
            <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="media-left">
                <p class="image is-64x64">
                    <img class="thumbnail" src="/images/thumbnail.svg" alt="论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds">
                </p>
            </a>
            
            <div class="media-content">
                <div class="content">
                    <div><time class="has-text-grey is-size-7 is-uppercase" datetime="2019-03-18T16:00:00.000Z">2019-03-19</time></div>
                    <a href="/2019/03/19/论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds/" class="has-link-black-ter is-size-6">论文笔记05：SABA A security-aware and budget-aware workflow scheduling strategy in clouds</a>
                    <p class="is-size-7 is-uppercase">
                        
                    </p>
                </div>
            </div>
        </article>
        
    </div>
</div>

    
        <div class="card widget">
    <div class="card-content">
        <div class="menu">
        <h3 class="menu-label">
            Archivos
        </h3>
        <ul class="menu-list">
        
        <li>
            <a class="level is-marginless" href="/archives/2019/05/">
                <span class="level-start">
                    <span class="level-item">May 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">3</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/03/">
                <span class="level-start">
                    <span class="level-item">March 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">9</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2019/02/">
                <span class="level-start">
                    <span class="level-item">February 2019</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">5</span>
                </span>
            </a>
        </li>
        
        <li>
            <a class="level is-marginless" href="/archives/2018/10/">
                <span class="level-start">
                    <span class="level-item">October 2018</span>
                </span>
                <span class="level-end">
                    <span class="level-item tag">2</span>
                </span>
            </a>
        </li>
        
        </ul>
        </div>
    </div>
</div>
    
        <div class="card widget">
    <div class="card-content">
        <div class="menu">
            <h3 class="menu-label">
                Etiquetas
            </h3>
            <div class="field is-grouped is-grouped-multiline">
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HBase/">
                        <span class="tag">HBase</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/HTTP/">
                        <span class="tag">HTTP</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/I-O多路复用/">
                        <span class="tag">I/O多路复用</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/JVM/">
                        <span class="tag">JVM</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java/">
                        <span class="tag">Java</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Java并发/">
                        <span class="tag">Java并发</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Kafka/">
                        <span class="tag">Kafka</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Redis/">
                        <span class="tag">Redis</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/Spring/">
                        <span class="tag">Spring</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/《谷歌方法论》/">
                        <span class="tag">《谷歌方法论》</span>
                        <span class="tag is-grey">4</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网站架构/">
                        <span class="tag">网站架构</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/网络/">
                        <span class="tag">网络</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/论文笔记/">
                        <span class="tag">论文笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/读书笔记/">
                        <span class="tag">读书笔记</span>
                        <span class="tag is-grey">5</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/锁/">
                        <span class="tag">锁</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
                <div class="control">
                    <a class="tags has-addons" href="/tags/面试题/">
                        <span class="tag">面试题</span>
                        <span class="tag is-grey">1</span>
                    </a>
                </div>
                
            </div>
        </div>
    </div>
</div>
    
    
</div>

            </div>
        </div>
    </section>
    <footer class="footer">
    <div class="container">
        <div class="level">
            <div class="level-start has-text-centered-mobile">
                <a class="footer-logo is-block has-mb-6" href="/">
                
                    <img src="/images/logo.svg" alt="Ivan的记录" height="28">
                
                </a>
                <p class="is-size-7">
                &copy; 2019 Ivan Lu&nbsp;
                Powered by <a href="https://hexo.io/" target="_blank">Hexo</a> & <a
                        href="https://github.com/ppoffice/hexo-theme-icarus" target="_blank">Icarus</a>
                
                </p>
            </div>
            <div class="level-end">
            
                <div class="field has-addons is-flex-center-mobile has-mt-5-mobile is-flex-wrap is-flex-middle">
                
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Creative Commons" href="https://creativecommons.org/">
                        
                        <i class="fab fa-creative-commons"></i>
                        
                    </a>
                </p>
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Attribution 4.0 International" href="https://creativecommons.org/licenses/by/4.0/">
                        
                        <i class="fab fa-creative-commons-by"></i>
                        
                    </a>
                </p>
                
                <p class="control">
                    <a class="button is-white is-large" target="_blank" title="Download on GitHub" href="https://github.com/ppoffice/hexo-theme-icarus">
                        
                        <i class="fab fa-github"></i>
                        
                    </a>
                </p>
                
                </div>
            
            </div>
        </div>
    </div>
</footer>
    <script src="https://cdn.jsdelivr.net/npm/jquery@3.3.1/dist/jquery.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/moment@2.22.2/min/moment-with-locales.min.js"></script>
<script>moment.locale("zh-Hans");</script>


    
    
    
    <script src="/js/animation.js"></script>
    

    
    
    
    <script src="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/js/lightgallery.min.js" defer></script>
    <script src="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/js/jquery.justifiedGallery.min.js" defer></script>
    <script src="/js/gallery.js" defer></script>
    

    
    

<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update
            my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="https://cdn.jsdelivr.net/npm/outdatedbrowser@1.1.5/outdatedbrowser/outdatedbrowser.min.js" defer></script>
<script>
    document.addEventListener("DOMContentLoaded", function () {
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        });
    });
</script>


    
    
<script src="https://cdn.jsdelivr.net/npm/mathjax@2.7.5/unpacked/MathJax.js?config=TeX-MML-AM_CHTML" defer></script>
<script>
document.addEventListener('DOMContentLoaded', function () {
    MathJax.Hub.Config({
        'HTML-CSS': {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
});
</script>

    
    

<a id="back-to-top" title="Kembali ke atas" href="javascript:;">
    <i class="fas fa-chevron-up"></i>
</a>
<script src="/js/back-to-top.js" defer></script>


    
    

    
    
    
    

    
    
    
    
    
    <script src="https://cdn.jsdelivr.net/npm/clipboard@2.0.4/dist/clipboard.min.js" defer></script>
    <script src="/js/clipboard.js" defer></script>
    

    
    
    


<script src="/js/main.js" defer></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Entradas',
                PAGES: 'Pages',
                CATEGORIES: 'Categorias',
                TAGS: 'Etiquetas',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js" defer></script>
<link rel="stylesheet" href="/css/search.css">
<link rel="stylesheet" href="/css/insight.css">
    
</body>
</html>